{
    "clubs": [
        {
            "name": "90.3 The Core",
            "description": "90.3 The Core is the student run radio station on Livingston Campus. We work to deliver outstanding alternative radio programming with PHS, to embrace local music, and to engage with our community."
        },
        {
            "name": "A. Life Ministry",
            "description": "The purpose of this organization is to create an environment where those far and near from God can experience the love of God."
        },
        {
            "name": "Academic Programs at Douglass Residential College - DRC",
            "description": "Academic Programs provides innovative programming for Douglass women through the Douglass Course, Global Village, Gender and Arts, and more."
        },
        {
            "name": "Academic Team",
            "description": "The Rutgers Academic Team is the organization for collegiate academic quizbowl involvement at Rutgers. We attend events held by ACF, NAQT, and more collegiate tournaments, and also host our own."
        },
        {
            "name": "Accounting Association (Rutgers University)",
            "description": "The RUAA, Rutgers University Accounting Association, strives to provide current, new, and prospective accounting students with the resources they need to improve themselves and succeed both at Rutgers and in the professional world."
        },
        {
            "name": "Active Minds at Rutgers",
            "description": "Active Minds Rutgers is dedicated to promoting mental wellness on campus and in the community. We arm students with the techniques to help them manage stress and encourage students to be advocates and support systems for their peers."
        },
        {
            "name": "Actuarial Club (Rutgers)",
            "description": "The RU Actuarial Club provides support, networking opportunities, and training for aspiring actuaries at Rutgers."
        },
        {
            "name": "Adventist Students for Christ",
            "description": "Adventist Students for Christ (ASC) is a Bible based ministry seeking to provide an environment for students to experience Christian fellowship, explore faith, and ultimately, to encounter Jesus Christ!"
        },
        {
            "name": "Ahlul Bayt Student Association",
            "description": "The Ahlul-Bayt Student Association’s mission is to cater primarily, although not exclusively, to the needs of the Shi’a students at Rutgers university while simultaneously representing their collective voices and pursuing their ideals."
        },
        {
            "name": "Ahmadiyya Muslim Students Association for Women",
            "description": "AMSAW's goal is to spread the message of Ahmadiyya, clear up misconceptions of Islam, promote interfaith dialogue, and bring people towards God."
        },
        {
            "name": "Aikido Sport Club (Rutgers Recreation)",
            "description": "Kokikai Aikido is a self-defense training system that stresses timing, centering and coordination rather than meeting force with force. Kokikai Aikido is a modern martial art."
        },
        {
            "name": "Air Force ROTC (Department at Rutgers University)",
            "description": "Air Force ROTC is a college program offered at more than 1,100 colleges and universities across the U.S. It prepares you to become an Air Force Officer while earning a college degree."
        },
        {
            "name": "Al Ghazali Club",
            "description": "Al Ghazali Club exists to provide opportunities for the Rutgers Muslim community to learn Islamic theosophical ideas through classically trained scholars in the form of consistently held classes."
        },
        {
            "name": "Albanian Roots",
            "description": "The purpose of the organization shall provide a network for students who are Albanian or have an interest in Albanian culture. We will give students the opportunity to connect with others and learn more about the country of Albania."
        },
        {
            "name": "All Marxist-Leninist Union",
            "description": "To educate and raise the class consciousness of students, faculty, and staff about the relationship between capital and the education system, and to prepare its members for future party work."
        },
        {
            "name": "Allied Health Professions Club of Rutgers University",
            "description": "The purpose of the organization shall be to educate students about the less known, but equally respectable allied health profession careers that are often outshined by the more common careers in medicine, nursing, dentistry and optometry."
        },
        {
            "name": "Alpha Chi Omega",
            "description": "Alpha Chi Omega Real. Strong. Women."
        },
        {
            "name": "Alpha Delta Phi",
            "description": "Since its creation in 1832 at Hamilton College, Alpha Delta Phi has held itself to the highest standard of excellence. Our 50,000+ alumni include former Presidents and Senators of the United States, as well as leaders in business and the sciences."
        },
        {
            "name": "Alpha Epsilon Delta (Health Preprofessional Honor Society)",
            "description": "The mission of Rutgers University AED is to encourage and recognize academic excellence among pre-health students."
        },
        {
            "name": "Alpha Eta Mu Beta",
            "description": "Alpha Eta Mu Beta is the honor society for biomedical engineering. The society promotes an understanding of the profession, and recognizes and encourages excellence within the field."
        },
        {
            "name": "Alpha Gamma Delta",
            "description": "Alpha Gamma Delta is an international women's fraternity that promotes academic excellence, philanthropic giving, ongoing leadership and personal development and above all, a spirit of loving sisterhood."
        },
        {
            "name": "Alpha Kappa Alpha",
            "description": "Cultivate high scholastic & ethical standards, promote unity & friendship among college women, study/help alleviate problems concerning girls & women in order to improve their social stature, maintain progressive interest in college life & be of service"
        },
        {
            "name": "alpha Kappa Delta Phi",
            "description": "The purpose of alpha Kappa Delta Phi is to promote sisterhood, scholarship, leadership, and Asian-American awareness in the university and in the community, while encouraging the expression of the individual."
        },
        {
            "name": "Alpha Omega",
            "description": "Alpha Omega is a group of Christian students on campus who seek to live out the word of God and to unconditionally love others."
        },
        {
            "name": "Alpha Omega Epsilon",
            "description": "Alpha Omega Epsilon is a professional & social sorority for women in engineering & technical science majors founded in 1983 that promotes friendship, leadership, and professionalism to all members of the organization, the community, & our professions."
        },
        {
            "name": "Alpha Phi Alpha",
            "description": "Alpha Phi Alpha Fraternity, Inc., develops leaders, promotes brotherhood and academic excellence, while providing service and advocacy for our communities."
        },
        {
            "name": "Alpha Phi Delta",
            "description": "Alpha Phi Delta Fraternity was founded in 1914 at Syracuse University in Syracuse, New York, by a group of men with Italian roots. While initially founded as a social society, it evolved into one of the most unique of American college fraternities."
        },
        {
            "name": "Alpha Phi Omega",
            "description": "Alpha Phi Omega | Leadership, Friendship, and Service | Co-ed Fraternity"
        },
        {
            "name": "Alpha Pi Mu",
            "description": "The Mission of Alpha Pi Mu •To confer recognition upon the industrial engineering student who has shown exceptional academic interests and abilities in his field."
        },
        {
            "name": "Alpha Sigma Phi",
            "description": "The Beta Theta Chapter of Alpha Sigma Phi at Rutgers University has existed on campus since 1931. Alpha Sigma Phi, or ASig for short, is a social fraternity that promotes community involvement through social, philanthropic, and service endeavors."
        },
        {
            "name": "Alpha Zeta",
            "description": "Gender-inclusive, Professional, Honors, and Service Fraternity open to students at the School of Environmental and Biological Sciences who are in the top 40% of their class."
        },
        {
            "name": "Alternative Breaks (Rutgers University)",
            "description": "The mission of this organization shall be to provide groups of Rutgers University undergraduate students with a semester-long experience centered on community service."
        },
        {
            "name": "Alumnae Engagement at Douglass Residential College - DRC",
            "description": "As alumnae, you can make an impact in the lives of current Douglass students through volunteer opportunities this spring."
        },
        {
            "name": "Alzheimer's Buddies (Rutgers)",
            "description": "Our mission is to improve the lives of dementia patients by pairing Rutgers students with dementia patients for weekly 1-on-1 visits. Volunteers will develop a strong friendship with their buddy and learn about the person underneath the disease."
        },
        {
            "name": "Amateur Skiing and Snowboarding (Rutgers)",
            "description": "At the Rutgers Snowboard and Ski Club, our mission is to create a vibrant and inclusive community for amateurs who are passionate about snowboarding and skiing. We aim to foster a fun, supportive environment that enables our members to hone their skills."
        },
        {
            "name": "American Cancer Society on RU Campus",
            "description": "American Cancer Society on RU Campus is a nationwide collaboration of college students, faculty, and staff dedicated to eliminating cancer by initiating and supporting programs of the American Cancer Society in college communities."
        },
        {
            "name": "American Choral Directors Association",
            "description": "ACDA provides community and opportunities for students to foster and promote their choral and singing abilities. Join us for our several workshops, masterclasses, and social events over the course of the semester!"
        },
        {
            "name": "American Institute of Aeronautics and Astronautics",
            "description": "Rutgers AIAA is the leading organization for undergraduate students who are interested in anything related to aerospace."
        },
        {
            "name": "American Institute of Chemical Engineers",
            "description": "AIChE is the world's leading organization for chemical engineering professionals, with over 45,000 members from over 100 countries."
        },
        {
            "name": "American Medical Student Association",
            "description": "The purpose of Rutgers American Medical Association is to provide an environment that supports the creative ideas of physicians and pre-health professionals in training and guide these students in their paths to graduate school."
        },
        {
            "name": "American Preventive Screening and Education Association",
            "description": "Get hands-on clinical experience by learning how to take blood pressure and going out into the community to run free health screenings for underserved populations. Learn more about public health research and preventative medicine!"
        },
        {
            "name": "American Sign Language Club",
            "description": "Spreading awareness of deaf/hard-of-hearing culture and teaching members American Sign Language."
        },
        {
            "name": "American Society of Civil Engineers",
            "description": "With a full suite of programs and resources to help you thrive, ASCE membership will help provide you with the knowledge and opportunities you’ll need to jump into the industry, get on the right career path, and have fun doing it."
        },
        {
            "name": "American Society of Highway Engineers",
            "description": "American Society of Highway Engineers educate students on highway engineering."
        },
        {
            "name": "American Society of Mechanical Engineers",
            "description": "What is ASME? ASME is the acronym for the American Society of Mechanical Engineers, a membership organization recognized globally for its leadership in providing the engineering community with technical content and a forum for information exchange."
        },
        {
            "name": "American Water Works Association Student Chapter",
            "description": "The American Water Works Association is an international, nonprofit, scientific and educational society dedicated to providing total water solutions assuring the effective management of water."
        },
        {
            "name": "Amnesty International (Rutgers)",
            "description": "The purpose of this organization shall be the promotion of human rights by providing a forum for activism and for students."
        },
        {
            "name": "ANAKBAYAN Rutgers",
            "description": "Anakbayan's seeks to arouse, organize, and mobilize both Filipinos and non-Filipinos to fight for National Democracy in the Philippines with a socialist perspective within Rutgers and the central Jersey area."
        },
        {
            "name": "Animation Club (Rutgers)",
            "description": "The Rutgers Animation Club teaches members every aspect of 2D animation and produces an original animated short film every year. Students of all majors and skill levels welcome!"
        },
        {
            "name": "Anime and Japanese Environmental Society",
            "description": "The purpose of our organization is to provide the students with a connection between Japanese animation, Japanese culture, and general entertainment."
        },
        {
            "name": "Anthologist",
            "description": "The Anthologist is a literary and arts magazine that has served in preserving and inspiring Rutgers’s creativity since 1927, publishing high-quality art and writing."
        },
        {
            "name": "Anthropology Graduate Student Association (AGSA) (Graduate Organization)",
            "description": "The purpose of this organization shall be to further the social, cultural and academic interests of the students in the graduate program in Anthropology."
        },
        {
            "name": "Application of Philosophy, Politics, Ethics, Analysis, and Logic Club (The)",
            "description": "The APPEAL Club is a dynamic and inclusive gathering of individuals who are passionate about fostering open, respectful, and thought-provoking discussions among people with diverse viewpoints."
        },
        {
            "name": "Arab Cultural Club",
            "description": "The purpose of this club is to invite members of the Rutgers community to learn and experience the beauty the Arab culture has to offer, as well as show contemporary issues Arabs face at home and abroad. Follow us on Instagram: @accrutgers."
        },
        {
            "name": "Archaeological Society (Rutgers)",
            "description": "Our mission is to promote the fascinating and ever-evolving field of archaeology to Rutgers University and the general public! Regardless of experience level, all are welcome here!"
        },
        {
            "name": "Armenian Student Association (Rutgers)",
            "description": "The purpose of this organization will be to provide an opportunity for fellowship among Armenian students at Rutgers University."
        },
        {
            "name": "Army ROTC (Rutgers)",
            "description": "Encouraging selfless service within the Rutgers community and greater New Brunswick area."
        },
        {
            "name": "Art and Design Club (Rutgers)",
            "description": "Join and pursue all forms of art and design including drawing, painting, crafts, and more! We meet Fridays 5:30-7PM at Murray Hall."
        },
        {
            "name": "Art History Graduate Student Organization (Graduate Organization)",
            "description": "The purpose of this organization shall be to further social, cultural, and academic interests of the students in the graduate program of Art History."
        },
        {
            "name": "Art History Student Association (Rutgers)",
            "description": "The purpose of the association is to provide a network for students who are interested in art history or art, and to create a forum for students to discuss, debate and socialize over their love for the field."
        },
        {
            "name": "Arts and Music Undergraduate Service Education",
            "description": "Through outreach initiatives and meetings-events, our members are able to provide an outlet for Rutgers students and others to follow their creative interests or pick up new ones while discovering ways to deal with stress and emotion in a healthy manner."
        },
        {
            "name": "Ascend Pan-Asian Leaders",
            "description": "The mission of Ascend - Rutgers, New Brunswick is to continuously influence and encourage professional development in students while serving as a collective voice for the Asian and Pacific Islander community."
        },
        {
            "name": "Ashley Lauren Foundation of Rutgers University (The)",
            "description": "The purpose of the organization shall assist in spreading awareness of and fundraising for pediatric cancer through an affiliation with the Ashley Lauren Foundation."
        },
        {
            "name": "Asian A cappella Group (Rutgers)",
            "description": "Rutgers RAAG is an award-winning, co-ed South Asian fusion a cappella group based out of Rutgers University in New Brunswick, New Jersey."
        },
        {
            "name": "Asian American Cultural Center",
            "description": "The Asian American Cultural Center offers a myriad of social, cultural, and educational opportunities designed to promote, respect and embrace the unique histories and cultural identities within the Asian Pacific Islander Desi American (APIDA) diaspora."
        },
        {
            "name": "Asian Pacific American Medical Student Association",
            "description": "Our goals are to unite and acknowledge not only Asian Pacific Islanders and Asians, but also those of other races in the scientific community with a focus on the healthcare aspect."
        },
        {
            "name": "Asian Student Council",
            "description": "The ASC's vision is to excel as a dynamic presence in the Rutgers community, shaping and enriching the college experience of all Rutgers students. All are welcome, and encouraged, to participate as members."
        },
        {
            "name": "Association for Neurological Disorders (Rutgers)",
            "description": "Rutgers Association for Neurological Disorders aims to raise awareness about neurological disorders, such as ALS, MS, and Dementia, to the students of Rutgers University."
        },
        {
            "name": "Association of Indians at Rutgers",
            "description": "AIR host events that promote cultural and social awareness of the Indian tradition to all students at Rutgers University."
        },
        {
            "name": "Association of International Relations; Model UN Team (Rutgers)",
            "description": "Rutgers' ONLY travel Model United Nations team!"
        },
        {
            "name": "Association of Latino Professionals for America",
            "description": "ALPFA exists to create opportunities, add value, and build relationships for its members, the community and its business partners through networking and expanding leadership in the global workforce."
        },
        {
            "name": "Association of Marketing and Strategy (Rutgers)",
            "description": "('22-'23) New Year, New Team... looking for New Members! RAMS is the central hub for all things marketing related. We want to provide a community for engaged students to network, discover their marketing passions, and develop their professional career!"
        },
        {
            "name": "Association of Philippine Students (Rutgers)",
            "description": "Rutgers Association of Philippine Students (RAPS) is the Filipinx/Fil-Am cultural organization on campus! We pride ourselves in openness, solidarity, community, celebrating Filipinx culture, and building connections that last a lifetime."
        },
        {
            "name": "Association of Punjabi Students at Rutgers University",
            "description": "The mission of Association of Punjabis at Rutgers University is to spread awareness about the rich heritage of the Punjabi culture through philanthropic events, general member meetings, fundraisers, and formal events!"
        },
        {
            "name": "Association of Undergraduate Geneticists",
            "description": "To establish a network of future colleagues in the biological science related fields, particularly Genetics. This network includes both current students, alumni, and faculty members in hopes that these networks last beyond graduation."
        },
        {
            "name": "Astronomical Society (Rutgers)",
            "description": "The chief enterprise of the Rutgers Astronomical Society involves uniting those who are fascinated with the vastness of space and who are interested in discussing and observing the cosmos."
        },
        {
            "name": "Aviation Club (Rutgers)",
            "description": "The Rutgers Aviation Club seeks to create a network of students interested in careers or vocations within aviation."
        },
        {
            "name": "Baby Friendly Space Club",
            "description": "The BFSC was created for any students who are interested in supporting Rutgers students and staff that have infants by helping to run and plan events for the Family Friendly Space."
        },
        {
            "name": "Bachata Club (Rutgers University)",
            "description": "Welcome! Bachata is a popular latinx dance. This club will help members gain a better understanding of everything that makes up Bachata including choreography, history & origins, culture, tools, and instruments."
        },
        {
            "name": "Badminton Sport Club (Rutgers Recreation)",
            "description": "The Rutgers Badminton Club seeks to bring out a friendly and professional environment in which people of all ages can interact in a sport that is suitable for all individuals. We welcome people of all fitness levels!"
        },
        {
            "name": "Ballroom Dance Sport Club (Rutgers Recreation)",
            "description": "We are Rutgers Ballroom! Throughout the week, we offer professional instruction for Standard and Latin styles of dances for all levels. We also compete at regional collegiate ballroom competitions as well as host our very own!"
        },
        {
            "name": "BAPS Campus Fellowship of Rutgers",
            "description": "The purpose of the organization shall be to unite students on Rutgers’s campus and provide opportunities to learn about Hindu heritage and culture and more Swaminarayan way of life."
        },
        {
            "name": "Barbara Voorhees Mentors",
            "description": "The Barbara Voorhees Mentor Program, located at the heart of the Douglass mission, serves to connect incoming students with the Douglass Residential College. Mentors are assigned to individual sections of the first-year course \"Issues in Women’s Leadersh."
        },
        {
            "name": "Baseball Sport Club (Rutgers Recreation)",
            "description": "The Rutgers Club Baseball team is a great opportunity for competitive baseball players to continue their athletic careers in college. RUCB is open to all students regardless of experience!"
        },
        {
            "name": "Basketball Men’s Sport Club (Rutgers Recreation)",
            "description": "Rutgers Men's Basketball Club"
        },
        {
            "name": "Basketball Women’s Sport Club (Rutgers Recreation)",
            "description": "The purpose of the Rutgers Women's Club Basketball Team is to provide females who have a passion for basketball to play at a competitive level without sacrificing all the time needed to play Division I basketball."
        },
        {
            "name": "Battle Royale",
            "description": "The Rutgers Battle Royale Club aims to bring all of those who enjoy Battle Royale games together. By gathering this genre of communities at Rutgers, we look forward to giving players the platform to not only practice and learn, but to meet new friends!"
        },
        {
            "name": "Bboy Student Organization of Rutgers",
            "description": "RU Breaks’ main focus is to allow students with an interest in urban dance to be part of our growing community. We aim to provide dancers of all levels a place to develop their skills through weekly workshops where we teach the fundamentals of breaking."
        },
        {
            "name": "Bellydance Troupe (Rutgers)",
            "description": "The Rutgers Belly Dance Troupe performs at on campus events in order to share the art of belly dance as well as to break any negative stigmas associated with the art form and promote body positivity and women empowerment."
        },
        {
            "name": "Bengali Students Association",
            "description": "The organization illustrates the diverse cultures of Bengali communities worldwide. Through dance, song, discussions, and various public events, the association will expose other cultures to our own rich culture."
        },
        {
            "name": "Beta Chi Theta",
            "description": "In the spring of 1999, eight young men had a vision to create a Social Fraternity in California steeped in South Asian culture. The inspiration for Beta Chi Theta was the embodiment of the bond of Brotherhood those eight shared with one another."
        },
        {
            "name": "Bhakti - The Higher Taste",
            "description": "Bhakti - the Higher Taste (RUBhakti) is a shared, spiritual space and community based on trust, respect, and compassion, exploring the principles that underlie yoga practice generally, and bhakti yoga specifically."
        },
        {
            "name": "Bhangra (Rutgers)",
            "description": "The Rutgers University Bhangra Team is a group of enthusiastic students who pride themselves in keeping the roots of bhangra alive while putting on entertaining performances highlighting Punjabi culture."
        },
        {
            "name": "Big Buddy (Rutgers University)",
            "description": "Our purpose is to provide social, moral, and academic guidance to the students at the Lincoln Elementary School in New Brunswick, New Jersey."
        },
        {
            "name": "Billiards Club (Rutgers University)",
            "description": "The Rutgers University Billiards Club, informally known as RUBC, is committed to establishing a lively and welcoming community of pool players. RUBC aims to provide a friendly, encouraging atmosphere where students from all walks of life may get together."
        },
        {
            "name": "Bioengineering Society",
            "description": "The Rutgers University Bioengineering Society is a student organization dedicated to cultivating interest in all areas of bioengineering (biomedical, biochemical, biomaterials, bioenvironmental, etc.)."
        },
        {
            "name": "Bioethics Society",
            "description": "The purpose of the organization shall be to raise general awareness of issues in bioethics in the Rutgers community by method of discussion and publications written by its members."
        },
        {
            "name": "Biomedical Engineering Society",
            "description": "Welcome to the Rutgers chapter of the Biomedical Engineering Society, where Biomedical Engineering students can learn about the BME discipline together."
        },
        {
            "name": "Biomedical Engineering Student Society (Graduate Organization)",
            "description": "Enrich graduate student experience by providing academic, professional, and social events; promote student-university relations."
        },
        {
            "name": "Black Mens Collective (The)",
            "description": "To aid in the development of male leaders of color, strive for academic excellence, and provide mentorship opportunities."
        },
        {
            "name": "Black Student Union",
            "description": "The purpose of this organization shall be to reach out to minority students, in order to give them an atmosphere in which they can express their concerns, grievances, and suggestions regarding problems in society-at-large."
        },
        {
            "name": "Blood Initiative (Rutgers University)",
            "description": "We are a community of dynamic and passionate young leaders dedicated to combating local blood shortages. Our mission is to support local blood centers by empowering, educating, and mobilizing the next generation of blood donors."
        },
        {
            "name": "Bloustein Public Service Association",
            "description": "BPSA, which was created to honor Edward J. Bloustein, a former Rutgers University President, an active citizen during his lifetime, seeks to provide a network for students interested in public service."
        },
        {
            "name": "BlueFoot Print Project",
            "description": "BlueFoot Print Project uses The Universal Declaration of Human Rights (UDHR) to practice activism and advocacy, specifically within the Black and Latinx communities, in order to expand representation of POC in human rights activism and professions."
        },
        {
            "name": "Blueprint",
            "description": "Blueprint is a community of students passionate about building better products. We are a close-knit group of product managers, designers, and engineers working together to launch, build, and improve products and break into product careers."
        },
        {
            "name": "Bowling Sport Club (Rutgers Recreation)",
            "description": "The Rutgers Bowling Sports Club strives to facilitate a love of bowling and allow members to compete at a high level, the USBC Collegiate Tournament scene. Our club is meant to allow players of all skill levels to enjoy the sport and improve their games."
        },
        {
            "name": "Brain Exercise Initiative",
            "description": "BEI cultivates a network of students that will develop and administer targeted brain exercises to elderly with Alzheimer's disease through clinical volunteering to help maintain and improve cognitive ability and memory."
        },
        {
            "name": "Brass Band (Rutgers University)",
            "description": "The purpose of the Rutgers University Brass Band is to serve as an artistic, musical, and educational experience that fosters musicianship, excellence, and student growth through the preparation and quality performances of brass band repertoire."
        },
        {
            "name": "Brazilian Jiu Jitsu Sport Club (Rutgers Recreation)",
            "description": "This club is dedicated to the practice and instruction of No-Gi Brazilian Jiu-Jitsu. Join our GroupMe if you are interested in joining the club: https://groupme.com/join_group/70734604/gw7iGlHk"
        },
        {
            "name": "Brazilian Students Association at Rutgers-New Brunswick",
            "description": "Our mission is to cultivate a vibrant and inclusive community passionate about Brazilian culture, enhancing Rutgers-New Brunswick through cultural promotion and support for Brazilian students."
        },
        {
            "name": "Buddhist Association (Rutgers University)",
            "description": "Rutgers University Buddhist Association (RUBA) provides a local Sangha for students who are interested in Buddhist culture to make friends and practice Buddhist meditation. We welcome all our new friends on the path!"
        },
        {
            "name": "Building Research, Advocacy, and Innovation in Neuroscience",
            "description": "BRAIN strives to inform its members and the Rutgers community, of global developments and interests in the fields of Neuroscience and Psychology through biweekly meetings, museum trips, volunteer work, hosting guest speakers, charity events, and more!"
        },
        {
            "name": "Bunting-Cobb Sciences Living-Learning Community",
            "description": "Bunting-Cobb Sciences Living-Learning Community (BCLLC) at Rutgers University offers a supportive community for women pursuing a degree in the sciences by recognizing the challenges and academic rigor of a science major and offering support."
        },
        {
            "name": "Busch Student Center - Student Staff",
            "description": "We provide services, activities, programs and facilities that complement the academic mission of the University."
        },
        {
            "name": "Business Association of Supply Chain Expertise",
            "description": "This organization, and the skills promoted by this organization are beneficial to all business majors, with a special concentration to Supply Chain majors."
        },
        {
            "name": "Business Governing Association (Rutgers)",
            "description": "The Rutgers Business Governing Association (RBGA) is the student governing body of the Rutgers Business School (RBS)."
        },
        {
            "name": "Business Information Technology Society",
            "description": "The purpose of the organization is to provide a network for Rutgers students with an interest in the Business Analytics and Information Technology major to increase opportunities and experiences in the field."
        },
        {
            "name": "Business School Blockchain Hub (Rutgers)",
            "description": "RBS Blockchain Hub is the Official Cryptocurrency and Blockchain Organization of Rutgers. Our mission is to educate the Rutgers community on the emerging technology blockchain and its cryptocurrency applications."
        },
        {
            "name": "Cabaret Theatre",
            "description": "Cabaret Theatre is a forum for students to learn about acting, directing, writing, business management, design, and construction through various workshops and hands-on experience."
        },
        {
            "name": "Calisthenics Club at Rutgers University",
            "description": "An organization dedicated to the practice of bodyweight training - calisthenics strength training, hand-balancing, and mobility."
        },
        {
            "name": "Canterbury House (Chaplaincy)",
            "description": "The Episcopal Church at Rutgers University is a community that worships, prays, and serves together."
        },
        {
            "name": "Canterbury House: the Episcopal Church at Rutgers",
            "description": "We are the spiritual and social presence of the Episcopal/Anglican Church to the Rutgers community. We are much more than 'just church'. We are committed to social justice and outreach. We worship and celebrate life. We welcome ALL."
        },
        {
            "name": "Cantonese Club (Rutgers)",
            "description": "The Rutgers Cantonese Club (RCC) is a social and cultural organization focused on sharing the Cantonese culture with the entire Rutgers community."
        },
        {
            "name": "Cap and Skull Senior Honor Society",
            "description": "The purpose of The Cap and Skull Society of Rutgers University – New Brunswick shall be to recognize students who demonstrate outstanding leadership, service, and character."
        },
        {
            "name": "Career Exploration and Success (Office of)",
            "description": "Career Exploration and Success (CES) is committed to assisting students with making connections between their academic experience and career paths."
        },
        {
            "name": "Casual Harmony",
            "description": "Casual Harmony is an A Cappella entertainment group, ranging from the voices of bass to countertenor, for the purpose of performance, competition, and music education."
        },
        {
            "name": "Catholic Campus Ministry (Chaplaincy)",
            "description": "The Catholic Center is the official diocesan ministry for university students, staff and faculty who come together to complement the academic and social dimensions of university life by practicing, sharing and developing their Catholic faith and culture."
        },
        {
            "name": "Catholic Student Association",
            "description": "Rutgers Catholic is an organization of university students, staff and faculty who come together to complement the academic and social dimensions of university life by practicing, sharing and developing their Catholic faith."
        },
        {
            "name": "Celebrating Latinx Arts & Works",
            "description": "CLAW seeks to create a network amongst Latinx artists within art, fashion, film, etc. and unite them through a common identity while also advocating for greater representation within the universal narratives of which we are often excluded."
        },
        {
            "name": "Cell Biology and Neuroscience Society",
            "description": "The CBN Society serves as a forum for social and intellectual interactions among students interested in neuroscience and related fields. We organize and facilitate a variety of science-related activities and events both on and off campus."
        },
        {
            "name": "Center for Islamic Life at RU (Chaplaincy)",
            "description": "Our vision is of a vibrant, modern center that provides educational, spiritual and counseling services for the Rutgers community with a focus on students."
        },
        {
            "name": "Center for Latino Arts and Culture",
            "description": "The Center for Latino Arts and Culture is a student-centered, inclusive community where students can better integrate experiential, academic, and service-learning about Latine/x arts and culture at Rutgers."
        },
        {
            "name": "Center for Social Justice Education and LGBT Communities (Rutgers University)",
            "description": "The Center for Social Justice Education and LGBT Communities (SJE) provides educational and social programs, leadership development, and policy consultation for LGBTQIA and ally students, faculty, staff, and community members."
        },
        {
            "name": "Center for Youth Political Participation",
            "description": "RU Voting is a nonpartisan effort to register, educate, and mobilize Rutgers students for elections; a project of the Darien Civic Engagement Project in conjunction with the Center for Youth Political Participation at Eagleton Institute of Politics."
        },
        {
            "name": "Central Asian Student Organization",
            "description": "Central Asian Student Organization aims to bring awareness to Central Asia through events that showcase aspects of its many cultures through language, food, music, etc."
        },
        {
            "name": "Chabad House Jewish Student Center (Chaplaincy)",
            "description": "Chabad is known for providing a relaxed, stable respite from the rigors of campus life, even as its dedicated leadership works frenetically to expand the range of events and social services Chabad offers."
        },
        {
            "name": "Chabad Jewish Student Organization",
            "description": "The purpose of our organization is dedicated to the cultural, educational, and social needs of the students at Rutgers."
        },
        {
            "name": "Changing Health Attitudes & Actions to Recreate Girls",
            "description": "We are Rutgers CHAARG + we're on a mission to show college students that health + fitness should be fun, and you can OWN yours! We are liberating girls from the elliptical + we lead the movement igniting a passion for exploring different forms of fitness."
        },
        {
            "name": "Charity: Water Rutgers",
            "description": "charity: water rutgers is a non-profit organization bringing clean and safe drinking water to people in developing nations. Our object as a Rutgers chapter is to bring awareness to the water crisis and to fundraise for various international projects!"
        },
        {
            "name": "Chavaya Student Organization of Rutgers",
            "description": "The purpose of the organization is to bring a sense of community to those who participate in the Rutgers Jewish Experience (RJX) chaplaincy."
        },
        {
            "name": "Cheese Club (Rutgers)",
            "description": "Cheese Club spreads the love of all things associated with cheese. We hope to educate our members on a myriad of different types of cheese and the cultures which they originate from."
        },
        {
            "name": "Chem-E-Car",
            "description": "Sponsored by the American Institute of Chemical Engineers, or AIChE, the Chem-E-Car competition is a bi-annual event which tests the rigor, teamwork and creativity of individual AIChE chapters."
        },
        {
            "name": "Chemical/Biochemical Engineering Graduate Student Organization",
            "description": "CBE-GSO is dedicated to supporting graduate students in achieving technical excellence and recognition in Chemical Engineering. We work to promote professional student-industry relations by providing opportunities and hosting programs for our members."
        },
        {
            "name": "Chemistry and Chemical Biology (Graduate Student Organization)",
            "description": "The CCB GSO serves the graduate students in the CCB department in order to enhance the graduate experience."
        },
        {
            "name": "Chemistry Society (Rutgers)",
            "description": "The society seeks to develop the Rutgers chemistry and science community by hosting broad-audience, hands-on events, science seminars, social events, and volunteering opportunities."
        },
        {
            "name": "Chess Club (Rutgers University)",
            "description": "Welcome to the Rutgers University Chess Club! Stop by at one of our meetings to play a few games with your fellow Scarlet Knights!"
        },
        {
            "name": "Chi Alpha Christian Fellowship",
            "description": "Jesus — Friends — Mission We are a diverse family of students passionately pursuing God, loving on Rutgers, & changing the world."
        },
        {
            "name": "Chi Alpha Christian Fellowship (Rutgers) (Chaplaincy)",
            "description": "We are a Spirit-empowered, diverse community of believers on campus, declaring in word and lifestyle our faith in Jesus Christ, equipped to fulfill our purpose in God’s global plan."
        },
        {
            "name": "Chi Alpha Epsilon",
            "description": "The Epsilon Mu Chapter within the Rutgers University School of Arts and Science Educational Opportunity Fund (EOF) Program strives to enhance the academic achievements of all its present future members."
        },
        {
            "name": "Chi Epsilon",
            "description": "We are members of the Rutgers University chapter of Chi Epsilon - the national civil engineering honor society."
        },
        {
            "name": "Chi Phi",
            "description": "Our mission is to build better men through lifelong friendships, leadership opportunities, and character development."
        },
        {
            "name": "Chi Psi",
            "description": "Chi Psi at Rutgers University is one of 32 Alphas (or Chapters) of the first social Fraternity, founded on May 20th, 1841. Our history, and devotion to brotherhood, defines our experience as Chi Psis."
        },
        {
            "name": "Chi Upsilon Sigma",
            "description": "Chi Upsilon Sigma National Latin Sorority, Incorporated (ΧΥΣ) is a Latina oriented Greek lettered sorority. We stand by our four core values of LEADERSHIP, SISTERHOOD, CHARACTER AND SERVICE. We strive to educate, elevate, and empower all women."
        },
        {
            "name": "Chinese Christian Church of Somerset (Chaplaincy)",
            "description": "Our vision is to establish multi-generational, multi-ethnic, and interdependent ministries; to empower new generations of church leaders, and to engage disciples for the Great Commission."
        },
        {
            "name": "Chinese Christian Fellowship",
            "description": "We are a student-run Christian organization with the purpose of providing a place for anyone to share and learn about the Christian faith. Our hope is to raise up spiritual leaders and to create an environment for people who want to develop their faith."
        },
        {
            "name": "Chinese Dance Troupe",
            "description": "The mission of Rutgers Chinese Dance Troupe (RCDT) is to enlighten the community of the beautiful art form of Chinese dance."
        },
        {
            "name": "Chinese Student Organization",
            "description": "To raise awareness and help establish identity by providing students with the opportunity to learn and socialize with others through common grounds in Chinese and Asian American culture."
        },
        {
            "name": "Chinese Students and Scholars Association (Rutgers)",
            "description": "RCSSA is an independent, non-political, and non-profit organization dedicated to providing and promoting social, intellectual, and cultural activities for Chinese students at Rutgers and other interested members of Rutgers community."
        },
        {
            "name": "Christians on Campus (Rutgers University)",
            "description": "We love the Lord Jesus! Together we grow in the Lord and pursue a closer relationship with Him by spending time with Him, spending time in His Word, and spending time with the brothers and sisters in Christ."
        },
        {
            "name": "Christians On Campus(Graduate Organization)",
            "description": "We love the Lord Jesus! Together we grow in the Lord and pursue a closer relationship with Him by spending time with Him, spending time in His Word, and spending time with the brothers and sisters in Christ."
        },
        {
            "name": "Christians United For Israel (Graduate Organization)",
            "description": "CUFI on Campus works to provide Christian student leaders with the skills, resources, relationships, and biblical teachings they need in order to speak up on behalf of Israel and the Jewish people at this crucial time."
        },
        {
            "name": "Circle K International",
            "description": "Circle K International is the largest student-led community service organization in the world with more than 13,000 members across the globe. We offer members unique opportunities in service, leadership, and fellowship. Live to Serve! Love to Serve!"
        },
        {
            "name": "Classics Graduate Student Association (Graduate Organization)",
            "description": "The purpose of this organization is to facilitate the social interaction, intellectual engagement, and professional development of those students interested in the ancient Mediterranean."
        },
        {
            "name": "Climate Reality RU",
            "description": "Climate Reality RU is a chapter of The Climate Reality Project, an international network of climate activists founded by Al Gore. Join us to get educated on the climate crisis and make real change."
        },
        {
            "name": "Clinical Psychology PhD (School of Arts and Sciences; Psychology Dept)(Gradute Organization)",
            "description": "The Clinical Psychology Ph.D. program provides the highest level of training for students wishing to conduct psychological research and/or provide clinical services as a practicing health-service psychologist."
        },
        {
            "name": "Coffee and Tea Association at Rutgers",
            "description": "Rutgers Coffee and Tea Association (RCTA) gathers all scarlet knights who are interested in different breeds of coffee and tea."
        },
        {
            "name": "Cognitive Science Club",
            "description": "Our organization is dedicated to creating an incredible Cognitive Science community here at Rutgers. We bring in top-tier speakers, thought-provoking debates, and mentorship opportunities!"
        },
        {
            "name": "Cognitive Science Graduate Student Association",
            "description": "We are an organization that aims to bring together graduate students from different Cognitive Science fields to discuss research and learn from each other in a friendly setting."
        },
        {
            "name": "College Avenue Players",
            "description": "The College Avenue Players is an active performing arts organization based on the College Avenue campus of Rutgers University – New Brunswick."
        },
        {
            "name": "Collegiate 100 of Rutgers University",
            "description": "The mission of the Collegiate 100 of Rutgers University is to support the sponsoring Chapter of 100 Black Men of New Jersey."
        },
        {
            "name": "Collegiate 4-H Club",
            "description": "The purposes of this organization shall consist of, but are not limited to, the following to encourage active student participation in 4-H activities while at college."
        },
        {
            "name": "Colombian American Student Association",
            "description": "The Colombian American Student Association (CASA) is a vibrant and culturally enriching organization that brings together students of Colombian heritage and those interested in Colombian culture at Rutgers University."
        },
        {
            "name": "Communications Department at Douglass Residential College - DRC",
            "description": "We are an office of professional staff, graduate assistants and undergraduate students with a focus on providing seamless communications processes, consistent updates through multiple media platforms and maintaining a cohesive brand."
        },
        {
            "name": "Community Health Outreach",
            "description": "Community Health Outreach (CHO) aims to provide children with comprehensive medical education, emphasizing character development and ethical values to nurture responsible societal contributors."
        },
        {
            "name": "Companion Animal Club",
            "description": "Students can network with other members interested in companion animals, volunteer with local animal rescues and get experience handling service dogs in training."
        },
        {
            "name": "Comparative Literature Graduate Association",
            "description": "The Comparative Literature Graduate Association organizes informal gatherings, talks, workshops, and conferences for the broader Rutgers community. Anyone interested in comparison and critique across languages, places, mediums, and histories is welcome!"
        },
        {
            "name": "Competitive Programming (Rutgers)",
            "description": "Welcome to the Rutgers Competitive Programming Club! Join us to sharpen your problem-solving skills, tackle algorithmic challenges, and take part in coding competitions."
        },
        {
            "name": "Computer Science Graduate Student Society (Graduate Organization)",
            "description": "Build a strong and vibrant CS graduate community."
        },
        {
            "name": "Computer Science Living-Learning Community (Douglass WiSE, DRC)",
            "description": "The Douglass-SAS-DIMACS Computer Science Living-Learning Community is an innovative STEM experience for first-year women who intend on majoring in computer science to live together on Busch Campus through a collaboration with the DRC and the SAS."
        },
        {
            "name": "Consulting Club (Rutgers)",
            "description": "The purpose of Rutgers Consulting is to provide students of all majors, business and non-business, with skills and competencies in all industries of consulting."
        },
        {
            "name": "Cook Student Organic Garden Club",
            "description": "Club dedicated to learning and using practical gardening techniques, and to connecting Rutgers students with opportunities to grow organic produce for personal nutrition/food security, recreation/leisure, research/education, and community service."
        },
        {
            "name": "Corporate Finance Society (Rutgers)",
            "description": "Our purpose is to prepare students for careers in the corporate finance industry. We focus on placing students in corporate finance, and treasury positions at leading firms."
        },
        {
            "name": "Costarricenses En Alianza",
            "description": "Costarricenses En Alianza club is committed to building an inclusive community, celebrating and advocating for Costa Rican culture to create unity and understanding in a diverse world."
        },
        {
            "name": "Council of Black Graduates (Graduate Student Organization)",
            "description": "Black Graduate Student Association dedicated to building community."
        },
        {
            "name": "Counseling, Alcohol and Other Drug Assistance Program & Psychiatric Services (University Department)",
            "description": "Counseling services are offered through Counseling, Alcohol and Other Drug Assistance Program & Psychiatric Services (CAPS), our University mental health support service."
        },
        {
            "name": "Counter-Strike Club (Rutgers)",
            "description": "We are the official Rutgers club for casual and competitive play of Counter-Strike:Global Offensive. We look to grow the community with our events, competitive teams, and meetups. For more information, join our Discord server: https://discord.gg/uJuk7ufw"
        },
        {
            "name": "Craft to Cure",
            "description": "As a community service organization, we wish to help others through the art of crafts, tailoring each donatable project to the community's needs."
        },
        {
            "name": "Creation of Games Society",
            "description": "Creation of Games Society is dedicated to providing resources and helping you build your game development skills in a collaborative space."
        },
        {
            "name": "Creative Expressions Publication",
            "description": "Rutgers Creative X publishes a digital blog that celebrates an inclusive community for students interested in UI/UX. We provide events for students to expand on their design potential through workshops, projects, designathon, and community events."
        },
        {
            "name": "Creative Writing Club (The Rutgers)",
            "description": "Do you like writing? Do you like hanging out and talking about everything from grammar to your favorite media? Like doing BOTH within a fun and hectic 2-hour window? Well, boy howdy, have we got the club for you!!!"
        },
        {
            "name": "Crew Sport Club (Rutgers Recreation)",
            "description": "​A Rutgers Tradition Since 1864"
        },
        {
            "name": "Criminal Justice Organization",
            "description": "We intend to inform and engage students, of relating majors, who are interested in the field Criminal Justice. To develop our members both academically as well as professionally, provide networking opportunities and engage them in community service."
        },
        {
            "name": "CRU",
            "description": "The purpose of this organization is to be a resource to interested students to answer questions and give counsel regarding principles of Christianity."
        },
        {
            "name": "CRU (Chaplaincy)",
            "description": "Rutgers Cru is a Christian group at Rutgers New Brunswick who aims to be a community where the Gospel captures hearts, transforms lives and launches men and women into a lifelong adventure with Christ."
        },
        {
            "name": "Culinary Club at Rutgers University",
            "description": "The purpose of the organization is to provide an opportunity for students to discover their passion for the culinary arts."
        },
        {
            "name": "Cultural Center Collaborative (Department at Rutgers University)",
            "description": "The Cultural Center Collaborative, within The Division of Student Affairs, is committed to supporting the needs of Rutgers’ campus communities by creating a welcoming and holistic learning environment for all members of the community."
        },
        {
            "name": "Cycling Sport Club (Rutgers Recreation)",
            "description": "Go Faster, Go Further, Go Higher. GO on two wheels! Whether you're a future pro or just starting, whether your tires are slick or knobby, Rutgers Cycling is for you! Amount for team dues are currently being decided due to an increase in race fees!"
        },
        {
            "name": "Data Science Club (Rutgers)",
            "description": "The Rutgers Data Science Club is for students interested in the skills and careers of data science!"
        },
        {
            "name": "Dean of Students (Rutgers University)",
            "description": "We provide solutions, services, and support to help students navigate Rutgers University. By focusing on students’ educational, social, and personal development, staff in the Office promote academic success and student retention."
        },
        {
            "name": "Debate Union (Rutgers University)",
            "description": "The purpose of this organization shall be to promote, participate, and compete in various formats of parliamentary debate."
        },
        {
            "name": "DECA",
            "description": "DECA prepares emerging leaders and entrepreneurs in marketing, finance, hospitality and management in high schools and colleges around the globe."
        },
        {
            "name": "Deep Treble",
            "description": "Founded in 1998, Deep Treble is the premier co-ed a cappella group at Rutgers University. The student-run organization performs at various events to spread music throughout the community and participates in nationwide competitions."
        },
        {
            "name": "Delta Chi",
            "description": "Since at least 1929, Delta Chi has recognized the following eleven men as the Founders of The Delta Chi Fraternity: Albert Sullard Barnes, Myron McKee Crandall, John Milton Gorham,Peter Schermerhorn Johnson, Edward Richard O’Malley, Owen Lincoln Potter,"
        },
        {
            "name": "Delta Gamma",
            "description": "Consistent with our Founders' thoughts in 1873, our primary purpose is to create an environment for our members in which lasting friendships and our vows of sisterhood emanate all aspects of our Fraternity."
        },
        {
            "name": "Delta Kappa Delta Sorority, Inc.",
            "description": "On October 1,1999, the concept of Delta Kappa Delta came to fruition at Texas A&M University. We begin our work with the purest of hearts -that of a child& in time, we hope that our work will benefit our communities& provide a lasting future."
        },
        {
            "name": "Delta Phi",
            "description": "In 1845, Delta Phi became the first fraternity at Rutgers University when the Epsilon Chapter was founded. All Delta Phi brothers follow the principals of friendship, morality, and literature."
        },
        {
            "name": "Delta Phi Omega",
            "description": "Delta Phi Omega Sorority, Inc. was established on December 6, 1998 by sixteen South Asian women from various backgrounds who dreamt of an organization that would bring unity and promote the advancement of South Asian women."
        },
        {
            "name": "Delta Sigma Iota",
            "description": "Delta Sigma Iota is a highly service oriented organization. Every brother goes above and beyond the minimum requirements imposed on them for service events."
        },
        {
            "name": "Delta Sigma Pi",
            "description": "America's Foremost Co-Ed Business Fraternity"
        },
        {
            "name": "Delta Sigma Theta Sorority, Inc.",
            "description": "Delta Sigma Theta Sorority, Inc. was founded on January 13, 1913 by 22 collegiate women at Howard University to promote academic excellence and provide assistance to those in need."
        },
        {
            "name": "Delta Upsilon",
            "description": "DU offers endless opportunities for the growth and betterment of our Brothers; opportunities stemming from philanthropic, academic, athletic, and social standpoints."
        },
        {
            "name": "Demarest Residential Community: College Ave Campus",
            "description": "The Demarest community offers students the ability to participate in at least one of ten special interest sections. Sections are small groups of students that come together based on a common interest e.g. Performing Arts, Music Appreciation, etc."
        },
        {
            "name": "Democrats (Rutgers University)",
            "description": "The Rutgers Democrats seeks to promote awareness and involvement in Democratic politics both within and beyond the Rutgers community. We hold weekly meetings on Wednesday at 7pm at the Douglass Student Center."
        },
        {
            "name": "Dental Knights Association",
            "description": "The purpose of this organization shall be to assemble Pre-Dental students in a fellowship of principles derived from friendship and unity."
        },
        {
            "name": "Department of Biochemistry and Microbiology (American Society for Microbiology- Rutgers Student Chapter)(Graduate Organization)",
            "description": "We are a graduate student organization affiliated with national ASM. We host social and informative events pertaining to the study of microbiology. This group provides an excellent way to meet other students involved in microbiology research on campus."
        },
        {
            "name": "Department of Plant Biology (Cook Researchers of Plant Science) (Graduate Organization)",
            "description": "We are the academic and social club of the Plant Biology graduate students."
        },
        {
            "name": "Desi Intercultural Youth Association",
            "description": "To celebrate various South Asian Cultures within our student body and to spread awareness of both South Asian Cultural norms and activities, as well as awareness of issues affecting the South Asian community within Rutgers University."
        },
        {
            "name": "Designer Genes: Rutgers Biotechnology Club",
            "description": "Designer Genes is THE biotechnology club at Rutgers, dedicated to aiding in the professional development of students in the field, serving and educating the community, and encouraging discussion about biotechnology!"
        },
        {
            "name": "Development and Family Engagement (University Department)",
            "description": "Inspiring philanthropic support and enduring connections with alumni, parents and friends of the university."
        },
        {
            "name": "Dhol Effect (Rutgers University)",
            "description": "Rutgers University Dhol Effect, also known as R.U.D.E., is the institution's only South-Asian fusion band composed of dynamic vocalists and instrumentalists."
        },
        {
            "name": "Diabetes Link (Rutgers)",
            "description": "The purpose of the organization Rutgers Diabetes Link was founded for the purpose of connecting college students with and affected by diabetes in the hopes that these connections will create a support network."
        },
        {
            "name": "Dining Services - Rutgers University",
            "description": "Rutgers Dining Services is committed to providing a high quality, efficient food operation in a safe and congenial environment."
        },
        {
            "name": "Disability Sports, Health, and Wellness (Center for, a University Academic Program)",
            "description": "The Center currently works with students, staff and community partners on disability issues that educate our students while enhancing the community of individuals with disabilities in New Jersey and at the University."
        },
        {
            "name": "Diversity Peer Educators",
            "description": "Diversity Peer Educators (DPEs) consist of Rutgers–New Brunswick students committed to educating their peers on topics of diversity, inclusion, and social justice."
        },
        {
            "name": "Divine Youth Associates",
            "description": "To create a divine relationship among the Rutgers students community through the principles of devotion and indwelling God; to understand more about our way of life, way of thinking, way of worship, and lead ourselves towards a wholesome integrated life."
        },
        {
            "name": "Douglass Black Students' Congress",
            "description": "\"Our goal is to instill black consciousness into the college community\""
        },
        {
            "name": "Douglass Book Club",
            "description": "The Douglass Book Club provides students with the opportunity to engage in literary discussion and explore a variety of genres."
        },
        {
            "name": "Douglass D.I.V.A.S.",
            "description": "This organization shall provide a network for students with a strong interest in women's issues, by providing a forum for students to discuss, debate, socialize and create lasting bonds."
        },
        {
            "name": "Douglass Diversity and Inclusion Program at Douglass Residential College - DRC",
            "description": "The mission of the Douglass Diversity, Equity, and Inclusion Program is to foster a diverse and inclusive environment at Douglass that challenges opinions, and validates identities and communities."
        },
        {
            "name": "Douglass Friends of UNFPA",
            "description": "The Reproductive Health Universal TaskForce (formerly The Douglass Friends of UNFPA) is for students who are interested in population and development issues, reproductive and maternal health, and infant mortality."
        },
        {
            "name": "Douglass Global Ambassadors",
            "description": "The Douglass Global Ambassadors provide peer support and resources for international students at Douglass Residential College, promoting global citizenship and cultural exchange."
        },
        {
            "name": "Douglass Governing Council",
            "description": "The Douglass Governing Council (DGC) is the student government body of Douglass Residential College. Our organization has been representing and empowering Douglass womxn since 1923."
        },
        {
            "name": "Douglass Pharmacy & Nursing Living Learning Community (Rutgers Department)",
            "description": "Douglass Pharmacy and Nursing Living Learning Community"
        },
        {
            "name": "Douglass Residential College: Office of the Dean",
            "description": "At Douglass Residential College, we are 2,600 women drawn from the Rutgers University–New Brunswick undergraduate population. Students pursue many majors and career paths, and come from many different backgrounds"
        },
        {
            "name": "Douglass Social Media Team",
            "description": "The Douglass Social Media Team manages and creates content for social media platforms that represent Douglass Residential College, engaging students and sharing information about events and opportunities."
        },
        {
            "name": "Douglass Student Recruitment Network",
            "description": "The purpose of DSRN is to provide prospective and enrolled students with the opportunity to explore and understand Douglass Residential College through the Douglass experience."
        },
        {
            "name": "Douglass Welcoming Ambassadors",
            "description": "This organization is sponsored by the Douglass Residential College and is advised by Allie Kroeper, amk253@echo.rutgers.edu."
        },
        {
            "name": "Douglass Women in Science and Engineering (WiSE)",
            "description": "Douglass Women in Science and Engineering supports the advancement of women in their STEM journeys at Rutgers. The Douglass WiSE community cultivates one’s STEM identity and provides experiences that complement academics. Be WiSE and join Douglass!"
        },
        {
            "name": "e-NABLE (Rutgers)",
            "description": "RU e-NABLE is a local chapter of a global group of volunteers who modify and 3D print prosthetic upper limb devices to give to children and adults in need for free!"
        },
        {
            "name": "Eagleton Institute of Politics",
            "description": "The Eagleton Institute of Politics explores state and national politics through research, education, and public service, linking the study of politics with its day-to-day practice."
        },
        {
            "name": "Earth and Planetary Sciences (Graduate Organization)",
            "description": "The Earth and Planetary Sciences Graduate Student Organization is a GSO composed of graduate students from the Rutgers EPS department."
        },
        {
            "name": "Ecology and Evolution Graduate Student Association (Graduate Organization)",
            "description": "The purpose of this organization shall be to further the social, cultural, academic and research interests of the students in the graduate program in Ecology and Evolution and to act as an intermediary between the graduate students and the faculty."
        },
        {
            "name": "Economics Society (Rutgers)",
            "description": "RECONS is a professional student-run organization focused on helping students explore and prep for diverse career paths in Economics. To join RECONS or learn more about us, please sign up for mailing list on our website: http://rutgersrecons.weebly.com"
        },
        {
            "name": "Educational Opportunity Program Student Association",
            "description": "The purpose of EOPSA shall be to serve as a liaison between the student body of the Educational Opportunity Fund Program and the staff."
        },
        {
            "name": "Edward J. Bloustein Drawing to Educate Students in Innovative Graphic Negotiation Skills (Graduate Organization)",
            "description": "The purpose of EJB DESIGNS is to facilitate discussion, practice, and innovation in the graphic conveyance of planning ideas. Recognizing that intuitive drawing skills improve a planner’s ability to design the physical environment, this organization..."
        },
        {
            "name": "Edward J. Bloustein School of Planning and Public Policy (Department at Rutgers)",
            "description": "The Edward J. Bloustein School of Planning and Public Policy serves as one of the nation’s key centers for the theory and practice of planning and public policy scholarship and analysis."
        },
        {
            "name": "Effective Altruism (Rutgers)",
            "description": "A group of students working to figure out the best ways to help others and improve the world, using evidence, reasoning, and research."
        },
        {
            "name": "Enactus of Rutgers University",
            "description": "Enactus is an international non-profit organization that brings together student, academic and business leaders who are committed to using the power of entrepreneurial action to improve the quality of life and standard of living for people in need."
        },
        {
            "name": "Endocrinology and Animal Biosciences (Graduate Student Organization)",
            "description": "The Endocrinology and Animal Biosciences Graduate Student Organization brings together all students affiliated with the department as well as its faculty and staff."
        },
        {
            "name": "Engineering Governing Council",
            "description": "The Engineering Governing Council (EGC) is the governing body of the Rutgers University School of Engineering on the New Brunswick/Piscataway Campus."
        },
        {
            "name": "Engineering Medical Society",
            "description": "EMS is a resource for engineering students who wish to pursue a career in medicine, serving these students by holding events, creating integrated engineering and pre-medical curricula, and more."
        },
        {
            "name": "Engineers in Action",
            "description": "Engineers in Action's Rutgers Chapter aims to engage students in order to help provide resources and opportunities to use their academic training to provide essential infrastructure for villagers suffering from rural isolation."
        },
        {
            "name": "Engineers Without Borders - USA",
            "description": "Engineers Without Borders-USA (EWB-USA) is a non-profit humanitarian organization established to partner with developing communities worldwide in order to improve their quality of life."
        },
        {
            "name": "Enrollment, Scholarship, Housing and Commuter Engagement at Douglass Residential College at Douglass Residential College - DRC",
            "description": "We are an office of three professional staff with a focus on recruiting a new incoming class each year, awarding any available scholarships and assisting with Douglass housing for Douglass students."
        },
        {
            "name": "Entomology Club (Rutgers)",
            "description": "Entomology Club is a place for insect enthusiasts and undergraduate students studying entomology to meet and form a vibrant community around a love of terrestrial arthropods."
        },
        {
            "name": "Entrepreneurial Society (Rutgers)",
            "description": "We are a community of innovators, creators and founders cultivating entrepreneurship and top talent at Rutgers University. Please check out our Instagram/discord page to keep up to date on upcoming events and opportunities!"
        },
        {
            "name": "Environmental Sciences Graduate Student Association (Graduate Organization)",
            "description": "The Environmental Sciences Graduate Student Association (ESGSA) is the Graduate Student Organization serving all Rutgers graduate students including the Environmental Science and Atmospheric Science graduate students."
        },
        {
            "name": "Equestrian Sport Club (Rutgers Recreation)",
            "description": "The Rutgers Equestrian Team (RUET) is an amicable and outgoing group of riders and horse lovers."
        },
        {
            "name": "Esports (Rutgers)",
            "description": "Rutgers Esports is the home of gaming at Rutgers University. It is a student-led umbrella organization for the Rutgers gaming community. We believe that gaming transcends all boundaries and will be the biggest cultural phenomena in the world."
        },
        {
            "name": "Esports Center (Rutgers Student Centers and Activities)",
            "description": "The Rutgers Esports Center is the official on-campus home for casual & competitive video gaming at Rutgers New Brunswick. The center features PC, console, and VR gaming stations that are available for students."
        },
        {
            "name": "Eta Kappa Nu",
            "description": "Eta Kappa Nu is a unique membership organization dedicated to encouraging and recognizing excellence in the electrical and computer engineering fields."
        },
        {
            "name": "Ethitech",
            "description": "Ethitech is dedicated to educating people about ethical issues in technology and leveraging computer science for good."
        },
        {
            "name": "Exercise Science and Sport Management Club",
            "description": "To establish a space for Rutgers students with a strong interest in sport management."
        },
        {
            "name": "F.A.C.E Modeling Team",
            "description": "A unique modeling team that promotes fashion, art, confidence and entertainment. Our purpose is to combine the love of fashion and modeling techniques to exude and build confidence."
        },
        {
            "name": "Fans of Philadelphia Eagles Rutgers",
            "description": "The FoPER provides a network for students with a strong interest in The Philadelphia Eagles to build friendships, and discuss their love and interest in the team while attending group events such as game parties, flag football, madden, and fundraisers."
        },
        {
            "name": "Fashion Organization of Retail and Marketing",
            "description": "FORM's goal is to unite Rutgers students with a passion for fashion, and provide them with opportunities to help them gain prospective careers in the business of fashion."
        },
        {
            "name": "Feminist Liberation Of Rutgers",
            "description": "This organization aims to foster a safe space for students interested in learning about and fueling the Feminist Movement, specifically considering intersectional issues."
        },
        {
            "name": "Fencing Sport Club (Rutgers Recreation)",
            "description": "Whether you are a seasoned veteran or first-timer, Rutgers Fencing Club welcomes you to learn the basics and practice with experienced fencers. We are a community that invites any and all individuals to experience this exciting sport."
        },
        {
            "name": "Field Hockey Sport Club (Rutgers Recreation)",
            "description": "Rutgers Club Field Hockey is an active member of the National Field Hockey League. The team consists of players with all different skill levels, ranging from years of playing to just learning the sport."
        },
        {
            "name": "Fighting Game Club (Rutgers)",
            "description": "The purpose of the organization is to bring the Rutgers fighting game community together in order to cultivate a social environment that appreciates and spreads interest in various fighting games, and fosters growth amongst the community."
        },
        {
            "name": "Figure Skating Sports Club (Rutgers Recreation)",
            "description": "Welcome to RUFSC! If you are looking to continue your figure skating career in college, you've come to the right place! RUFSC promotes the sport of figure skating in a recreational and competitive way that is affordable for all students. ⛸️"
        },
        {
            "name": "Film Productions (Rutgers University)",
            "description": "Rutgers University Film Productions (RUFP) is a student-run organization that gives students of Rutgers University the opportunity to utilize and enhance their creative talents through the multi-faceted and exciting world of film production!"
        },
        {
            "name": "First Light",
            "description": "We are Rutgers' first Christian a cappella group. We exist to embody Christ's love as one family and to spread the gospel through singing praises to our Savior."
        },
        {
            "name": "First Love Rutgers Fellowship",
            "description": "First Love Rutgers shall provide its members on Rutgers University campus teachings which will provide a solid Bible knowledge and equip its member to teach the Gospel with outreach and evangelism techniques and strategies peculiar to our age and time."
        },
        {
            "name": "Food Hotline (Rutgers University)",
            "description": "The Rutgers University Food Hotline aims to connect students in need with the pantry during off-hours. Through a dedicated hotline managed by university volunteers, we bridge the availability gap for food-insecure students when the pantry is closed."
        },
        {
            "name": "Food Science GSA (Graduate Organization)",
            "description": "Food Science GSA is a community for graduate students in, or interested in, the Food Science or Food Science related programs to connect with and learn from one another."
        },
        {
            "name": "Forestry Club (Rutgers University)",
            "description": "The Rutgers University Forestry Club is a community that is dedicated to cultivating experiences related to Forestry and Arboriculture. We are affiliated with the Society of American Foresters(SAF) and the International Society of Arboriculture(ISA)"
        },
        {
            "name": "Fraternity and Sorority Affairs (OFSA)",
            "description": "Rutgers University Fraternity and Sorority Affairs advises over 70 registered, national fraternities and sororities and offers a variety of ways to “go Greek”."
        },
        {
            "name": "French Arts Culture & Inclusive Language Experience",
            "description": "The purpose of FACILE is to create a safe environment to learn French arts, culture, and language. FACILE aims to celebrate and educate students on the diversity of Francophone and French culture."
        },
        {
            "name": "French GSO (Graduate Organization)",
            "description": "Our office mainly organizes events, such as conferences and cultural festivals, to promote the French and francophone worlds."
        },
        {
            "name": "Furry Culture Association",
            "description": "The purpose of the FCA is to provide students of Rutgers University that identify as members of the Furry community, or who have interests similar to that of the Furry community, with a means of networking with other members of that community."
        },
        {
            "name": "Fusion: The Rutgers Union of Mixed People",
            "description": "Fusion: The Rutgers Union of Mixed People aims to unite people who identify with or are interested in the multiracial experience (multiracial, multiethnic, interracial relationships, transracial adoption, etc.)."
        },
        {
            "name": "Future Business Leaders of America",
            "description": "Future Business Leaders of America provides opportunities for students to develop the necessary behavioral and technical skills needed to succeed in any future career, regardless of major. We are committed to inclusivity and delivering impactful results."
        },
        {
            "name": "Future Healthcare Administrators",
            "description": "Student-led organization dedicated to developing future healthcare leaders."
        },
        {
            "name": "Future Leaders in Student Affairs (Graduate Organization)",
            "description": "It is the mission of the Future Leaders in Student Affairs to provide our colleagues with services and programs that promote active learning, build a supportive community, and promote personal and professional development."
        },
        {
            "name": "Future Scholars Dream Team (Rutgers)",
            "description": "To encourage, cultivate and empower Rutgers undergraduate students as well as Rutgers Future Scholars students to ultimately become goal oriented leaders and change agents of the future by Raising R Leaders through personal and professional development."
        },
        {
            "name": "Future Teachers Association",
            "description": "The purpose of Future Teachers Association is to provide a network for students with a strong interest in teaching and/or education. This club provides helpful resources regarding graduate school applications, job opportunities, and scheduling."
        },
        {
            "name": "G. H. Cook Biochemistry & Microbiology Club",
            "description": "The G.H. Cook Biochemistry & Microbiology Club aims to foster fellowship and a sense of camaraderie between faculty and students by stimulating interest in the fields of biochemistry and microbiology."
        },
        {
            "name": "Gamma Phi Beta",
            "description": "At Gamma Phi Beta, our main goal is to foster a nurturing environment where young women can rise to their full potential by staying committed to their intellectual growth and achievement, individual worth, and service to humanity."
        },
        {
            "name": "Genetic Counseling Interest Club",
            "description": "The Genetic Counseling Interest Club (GCIC) is a way for all students to learn about the field of genetic counseling."
        },
        {
            "name": "Geology Club",
            "description": "To inform and inspire EPS students and other rock enthusiasts about the great field of geology."
        },
        {
            "name": "German Club at Rutgers University",
            "description": "The purpose of this organization shall be to promote and encourage interest in German culture and to provide Rutgers students with a place to practice German outside of the classroom."
        },
        {
            "name": "German GSO (Graduate Organization)",
            "description": "We are a vibrant and engaged community of graduate students whose mission is to stay connected and learn together."
        },
        {
            "name": "getINVOLVED Help, Resources, and Training",
            "description": "Find helpful 'How To' Resources for managing your getINVOLVED Profile."
        },
        {
            "name": "Gift of Life - Rutgers Chapter",
            "description": "Gift of Life – Rutgers Chapter raises awareness for the bone marrow donation process. Gift of Life - Rutgers Chapter collaborates with the Gift of Life national organization to help raise awareness and get everyone swabbed into the bone marrow registry."
        },
        {
            "name": "Girl Gains Rutgers",
            "description": "Our mission is to empower women to take up space in the weight room with the ultimate goal of growing confidence in a judgment-free, safe, and inclusive environment."
        },
        {
            "name": "Girls Club- Rutgers",
            "description": "Girls Club aims to help women aspiring to work in the sports industry through workshops, guest speakers, and networking opportunities to grow and develop together."
        },
        {
            "name": "GlamourGals: Rutgers University Chapter",
            "description": "GlamourGals is a national organization designed to empower women! During our monthly service trips to local senior homes, we provide women with complimentary manicures- demonstrating how acts of kindness can improve others mental & physical well-being."
        },
        {
            "name": "Glee Club at Rutgers University",
            "description": "The purpose of the Glee Club is to be an artistic and social experience that provides camaraderie, education, and student development."
        },
        {
            "name": "Global Surgery Student Alliance at Rutgers",
            "description": "The purpose of the organization shall be to act as a forum for students with a strong interest in Global Surgery, to network, discuss, advocate for and participate in research and educational opportunities within the growing field of Global Surgery."
        },
        {
            "name": "GlobeMed at Rutgers University",
            "description": "The mission of GlobeMed is to connect the assets of a student-led network to grassroots health organizations working in communities around the world."
        },
        {
            "name": "GO Outdoors Adventure Recreation (Rutgers Recreation)",
            "description": "GO Outdoors is a subdivision of the Rutgers Recreation Department. We bring students outside through a multitude of trips and courses while teaching leadership and survival skills for the adventurous outdoors person."
        },
        {
            "name": "Golf Sport Club (Rutgers Recreation)",
            "description": "The Rutgers Golf Club is for students of all skill levels to come and develop their golf game. Members are given range sessions and lessons. Our team also competes competitively in NCCGA regional tournaments."
        },
        {
            "name": "Grace Extended",
            "description": "To invite everyone to experience a truly personal, transformative relationship with Christ (not an associative or social one) by exemplifying the palpable presence of God through a college community."
        },
        {
            "name": "Graduate English Student Association (Graduate Organization)",
            "description": "The Graduate English Student Association organizes and supports social and academic events and activities for graduate students in the English department."
        },
        {
            "name": "Graduate Entomology Student Association (Graduate Organization)",
            "description": "GESA is committed to furthering the academic and professional interests of students of the graduate program of Entomology at Rutgers University, particularly through the formation and maintenance of relationships."
        },
        {
            "name": "Graduate Geographers Project (Graduate Organization)",
            "description": "The Graduate Geographers Project (GGP to its friends) is a group of graduate students in the Geography program at Rutgers University who work together to enhance each others' experience as students."
        },
        {
            "name": "Graduate History Association (Graduate Organization)",
            "description": "Association for Graduate Students in the History Department."
        },
        {
            "name": "Graduate School of Applied and Professional Psychology Student Alliance (Graduate Organization)",
            "description": "Our organization works to provide programming that reflects student interest, acts as a liaison between students and administration, and works to improve the culture and climate of GSAPP."
        },
        {
            "name": "Graduate School of Education Student Affairs Committee (Graduate Organization)",
            "description": "The GSE Student Affairs Committee (GSAC) is a student-run organization open to all graduate students at the Rutgers Graduate School of Education (GSE). The purpose of GSAC is to enrich the social, cultural, and academic climate of the Rutgers GSE."
        },
        {
            "name": "Graduate Student Association (GSA)",
            "description": "The Rutgers Graduate Student Association (GSA) is the official graduate student government of the Rutgers New Brunswick/Piscataway campus."
        },
        {
            "name": "Graduate Student Life (Department at Rutgers University)",
            "description": "The Office of Graduate Student Life at Rutgers University – New Brunswick advocates and supports holistic services that advance a vibrant graduate student experience."
        },
        {
            "name": "Graduate Students of Rutgers Hillel",
            "description": "Graduate Students of Rutgers Hillel is an organization for Jewish graduate students at Rutgers. We hold a variety of events with the goal of fostering Jewish community, especially on Shabbat."
        },
        {
            "name": "Graduate Union of Civil and Environmental Engineering (Graduate Organization)",
            "description": "GUCEE aims to create the bond between graduate students, professors and faculty through events that will create a casual environment for socialization in the CEE Dept. Our events are also great for networking and building long lasting connections."
        },
        {
            "name": "Graduate Union of Sociology Students (Graduate Organization)",
            "description": "We represent and organize for the interests of graduate students in the Sociology Department. We also organize social events within our community."
        },
        {
            "name": "Greek Graduates of Rutgers (Graduate Organization)",
            "description": "Our goal is to introduce people to the Greek culture, through cinema, music and cuisine, as well as promote aspects of the Mediterranean lifestyle. Moreover, we aim to provide a supportive environment to incoming Greek graduate students."
        },
        {
            "name": "Greek Programming Board",
            "description": "The Greek Programming Board (GPB) serves the Greek community at Rutgers University, comprising members from all four Greek constituent groups (IFC, MGC, PH and PFC)."
        },
        {
            "name": "Green Print",
            "description": "Green Print is a student-run magazine which allows students to explore the environment around them through writing, design and photography. Written by students, and for students at www.rugreenprint.com!"
        },
        {
            "name": "GSA Spanish & Portuguese (Graduate Organization)",
            "description": "Our activities are aimed at furthering the social, cultural and academic interests of the students in the graduate program in Bilingualism and Second Language Acquisition at the Department of Spanish and Portuguese."
        },
        {
            "name": "Gujarati Student Association",
            "description": "Gujarati Student Association focuses on highlighting the Gujarati community at Rutgers. Our goal is to show Gujarati culture through entertainment, public events, and discussions. All students are welcome to attend meetings."
        },
        {
            "name": "Gymnastics Sport Club (Rutgers Recreation)",
            "description": "The Rutgers University Club Gymnastics Team practices 3 times a week in the Athletic Performance Center on Livingston. All experience levels are welcome to join, competitive and non-competitive."
        },
        {
            "name": "Habitat for Humanity",
            "description": "Rutgers Habitat for Humanity aims to advocate for our organization's vision to provide affordable and decent housing for families and individuals in need. We aim to promote the vision through fundraising and helping families through build sites."
        },
        {
            "name": "Hack4Impact Rutgers",
            "description": "Hack4Impact is a student-run organization that builds non-profit software as tools for social good. The Rutgers Chapter seeks to build impactful tech products to give back to the community and encourage tech for social change."
        },
        {
            "name": "Haitian Association at Rutgers University (HARU)",
            "description": "The purpose of the organization shall be to educate the Rutgers University community about the history, and culture of the Haitian people."
        },
        {
            "name": "Happy Horizons at Rutgers",
            "description": "The Rutgers Happy Horizons Chapter seeks to educate and spread awareness about underprivileged societies in India. With our partnered non-profit, Happy Horizons Trust, we support education and healthcare India-based projects through service."
        },
        {
            "name": "Haru: Kpop Dance Cover Club",
            "description": "HARU is a K-POP cover dance organization that allows students to learn and perform choreography from various popular songs in Korea. All members are given the opportunity to improve their dancing skills and network with those of similar interests."
        },
        {
            "name": "Health Occupations Students of America",
            "description": "HOSA's mission is to promote career opportunities in the health care industry and to enhance the delivery quality health care to all people, through participation in health-related competitive events and acts of service."
        },
        {
            "name": "Health Science Research Symposium Committee",
            "description": "Please fill in"
        },
        {
            "name": "Healthy Kids of New Brunswick",
            "description": "In an effort to promote active lifestyles among the New Brunswick community, our objective is to promote good health and fun by working with the youth of New Brunswick through interactive fitness classes and nutrition programs."
        },
        {
            "name": "Hearthstone",
            "description": "Looking for fellow Hearthstone players? We discuss strategies, share highlights, and compete in regular tournaments! Join us by the hearth for fun games with good company."
        },
        {
            "name": "Heath Outreach, Promotion & Education (HOPE)",
            "description": "Foster and cultivate health and wellness at Rutgers University through outreach and education."
        },
        {
            "name": "Hebrew Club (Rutgers)",
            "description": "Our club aims to be a safe space for people to learn about Israeli culture and the Hebrew language through activities, food, and good company."
        },
        {
            "name": "Hellenic Cultural Association",
            "description": "The Hellenic Cultural Association of Rutgers University strives to unite fellow Greek students as well as non-Greek students who share the love of the Hellenic culture."
        },
        {
            "name": "Her Campus Rutgers",
            "description": "Her Campus Rutgers is a community of empowered and creative women sharing their voices through article writing and digital content creation. Our social events are the perfect opportunity to find a family at Rutgers."
        },
        {
            "name": "Herpetology Program of Rutgers (The)",
            "description": "Our goal is to help educate the public about the care and management of reptiles as pets, and in a broader spectrum, the conservation and restoration of reptilian species."
        },
        {
            "name": "Hillel (Rutgers)",
            "description": "Rutgers Hillel’s mission is to provide opportunities for every Jewish student at Rutgers University to deepen their connection to Jewish identity and Jewish community."
        },
        {
            "name": "Hindi-Urdu Language and Culture Club",
            "description": "The Hindi-Urdu Language and Culture Association is a space for students interested in the Hindi and Urdu languages to explore language, literature, and culture."
        },
        {
            "name": "Hindu Students Council (Rutgers)",
            "description": "Rutgers HSC is a non-sectarian international forum for the education and promotion of the Hindu cultural and spiritual heritage."
        },
        {
            "name": "Hindu YUVA",
            "description": "Hindu YUVA aims to create a strong Hindu presence and voice at Rutgers University by bringing students and like-minded organizations together. It acts as a bridge between students, the administration, and the Hindu community."
        },
        {
            "name": "Hispanic Organization of Professional Psychology Students",
            "description": "HOPPS aims to provide support to our Hispanic/Latinx graduate student body through mentorship opportunities, a culturally-relevant community, social events, and educational presentations."
        },
        {
            "name": "Hong Kong Student Association",
            "description": "Our mission is to expand knowledge of cultural adjustment, education, and society while helping college students of all backgrounds make new friends and gain beneficial skills."
        },
        {
            "name": "Honors College",
            "description": "A place where meaningful innovation is born out of collaboration between students and faculty from across the liberal arts and professional schools."
        },
        {
            "name": "Hope4spandana",
            "description": "Hope4spandana is a nonprofit organization focused on spreading awareness about autism and other mental disorders to maximize their quality of life."
        },
        {
            "name": "Horror Society (Rutgers)",
            "description": "Rutgers’ sole club dedicated to year-round discussion and analysis of all things horror."
        },
        {
            "name": "House the Hub",
            "description": "House the Hub serves the homeless community of New Brunswick through advocacy, fundraising, and volunteering."
        },
        {
            "name": "Humanity First Students Organization",
            "description": "The Humanity First Students Organization gathers young individuals to make the world a better place through philanthropy, education, and fundraising initiatives."
        },
        {
            "name": "Ice Hockey Men’s D1 Sport Club (Rutgers Recreation)",
            "description": "Rutgers Ice Hockey Men’s D1 Sport Club offers competitive opportunities and a history dating back to 1892."
        },
        {
            "name": "Ice Hockey Men’s D2 Sport Club (Rutgers Recreation)",
            "description": "Rutgers Ice Hockey Men’s D2 Sport Club offers opportunities for competitive play and camaraderie."
        },
        {
            "name": "Incoming Students 2022-2023: Student Orientation and Transition Programs",
            "description": "A group for incoming students to assist with their transition to Rutgers University."
        },
        {
            "name": "Incoming Students 2024-2025: Student Orientation & Transition Programs",
            "description": "A group for incoming students to assist with their transition to Rutgers University."
        },
        {
            "name": "Incorruptible U at Rutgers University",
            "description": "Incorruptible U advocates against vaping and smoking while encouraging healthy behaviors through educational presentations, interactive events, and legislative projects."
        },
        {
            "name": "Indian Christian Fellowship",
            "description": "Indian Christian Fellowship (ICF) unites students across campus through the expression of Christian faith and Indian culture, regardless of denomination or religion."
        },
        {
            "name": "Indigenous Turtle Island Club (Rutgers)",
            "description": "RU Indigenous Turtle Island welcomes students of all backgrounds to learn about and participate in Indigenous culture, history, and issues."
        },
        {
            "name": "Innovation, Design, and Entrepreneurship Academy",
            "description": "The Innovation, Design, and Entrepreneurship Academy provides opportunities for students to explore design and entrepreneurship at Rutgers."
        },
        {
            "name": "Institute for Domestic and International Affairs (IDIA - Rutgers)",
            "description": "IDIA-RU provides a forum for Rutgers students to help high schoolers understand their role in global and domestic civil society through Model United Nations and Congress conferences."
        },
        {
            "name": "Institute for Women's Leadership (Rutgers University)",
            "description": "The Institute for Women's Leadership at Rutgers is a consortium of units focusing on teaching, research, and public service in women's leadership."
        },
        {
            "name": "Institute of Electrical and Electronics Engineers",
            "description": "Rutgers IEEE is a student branch of the world’s largest professional association dedicated to technological innovation, focusing on ML/AI, Robotics, Coding, and Electronics."
        },
        {
            "name": "Institute of Industrial and Systems Engineers",
            "description": "IISE is the world's largest professional society supporting the industrial engineering profession and individuals involved with improving quality and productivity."
        },
        {
            "name": "Interfraternity Council (IFC)",
            "description": "The governing body of over 25 member fraternities at Rutgers University."
        },
        {
            "name": "International Friends at Rutgers (Chaplaincy)",
            "description": "Our mission is to befriend every international student at Rutgers, allowing them to experience the love of Jesus Christ and equipping them to serve Christ."
        },
        {
            "name": "International Friendship Program",
            "description": "IFP brings together Rutgers international students with local community members in a conducive environment for cross-cultural friendship and learning."
        },
        {
            "name": "International Society for Pharmaceutical Engineering",
            "description": "To educate students about the growing Pharmaceutical and Medical Device Industry."
        },
        {
            "name": "Internship Accelerator",
            "description": "Internship Accelerator equips Rutgers students with skills, knowledge, and connections to excel in their careers through comprehensive internship preparation."
        },
        {
            "name": "Intervarsity Multi-Ethnic Christian Fellowship",
            "description": "To explore the unifying, cross-cultural appeal of the Gospel of Jesus Christ through a community of students and faculty."
        },
        {
            "name": "Into the Light",
            "description": "INTO THE LIGHT fosters conversations around mental health among teens and young adults through peer-led presentations and community events."
        },
        {
            "name": "Iota Nu Delta Fraternity Incorporated",
            "description": "Iota Nu Delta develops well-rounded men to be tomorrow’s leaders, emphasizing progress in our global society."
        },
        {
            "name": "Iota Phi Theta",
            "description": "Iota Phi Theta makes meaningful contributions to society, especially within the African-American community."
        },
        {
            "name": "Irish Dance Club",
            "description": "The Irish Dance Club provides a network for students with an interest in Irish Dancing, offering a forum for discussion, debate, and socializing."
        },
        {
            "name": "IseCos Cosplay Club",
            "description": "IseCos Cosplay Club offers a safe and respectful space for students interested in cosplay, anime, and performance, fostering a welcoming community."
        },
        {
            "name": "Italian Club (Rutgers)",
            "description": "The Italian Club celebrates Italian culture through immersion and education."
        },
        {
            "name": "Italian Graduate Society (Graduate Organization)",
            "description": "The Italian Graduate Society promotes opportunities for sharing scholarly research in Italian Studies."
        },
        {
            "name": "J Voorhees Zimmerli Art Museum",
            "description": "The Zimmerli Art Museum at Rutgers University is one of the largest and most distinguished university-based museums in the country."
        },
        {
            "name": "J-BIZ: The Jewish Career Network at Rutgers",
            "description": "JBIZ offers guidance to students pursuing careers in business while helping them develop their Jewish identity."
        },
        {
            "name": "Japanese Conversation Club",
            "description": "The Japanese Conversation Club provides a forum for students to learn and practice the Japanese language in a peer-to-peer environment."
        },
        {
            "name": "Japanese Student Association",
            "description": "JSA provides a community for students interested in Japanese culture to celebrate and learn together."
        },
        {
            "name": "Japanese Visual Culture Association",
            "description": "The Japanese Visual Culture Association promotes appreciation and involvement in Japanese visual culture through relevant activities."
        },
        {
            "name": "Jewish Allies and Queers",
            "description": "Jewish Allies and Queers creates a safe and affirming environment for Jewish LGBTQ individuals and their allies."
        },
        {
            "name": "Jewish Student Union (Rutgers)",
            "description": "The Rutgers Jewish Student Union provides cultural programs, unity initiatives, and publishes a magazine and newsletter to promote cultural opportunities."
        },
        {
            "name": "Jewish Xperience (Chaplaincy)",
            "description": "Jewish Xperience offers social, professional, educational opportunities, trips, and internships for Jewish students to grow with the Rutgers Jewish community."
        },
        {
            "name": "Jhoom Dynamix",
            "description": "Jhoom Dynamix provides a platform for students with a passion for Indian dance/Bollywood to participate in a non-competitive environment."
        },
        {
            "name": "JMed: The Jewish Pre-Health Professions Network at Rutgers",
            "description": "JMed affords students the opportunity to explore the intersection between Judaism and careers in healthcare."
        },
        {
            "name": "Joshua Cantonese Christian Fellowship",
            "description": "To promote cultural appreciation and religious communication."
        },
        {
            "name": "JStreetU of Rutgers University, New Brunswick",
            "description": "JStreetU RU is a progressive educational and political action organization aimed at organizing the Rutgers student body for Pro-Israel/Pro-Palestine/Pro-Peace action."
        },
        {
            "name": "JTech (Rutgers-NB)",
            "description": "Rutgers JTech supports professional development, internships, and fosters community among Jewish-identifying students in engineering, CS, and IT."
        },
        {
            "name": "Jumu’ah (Rutgers)",
            "description": "Rutgers Jumu’ah is a student group that plans and coordinates weekly Jumu’ah (Friday prayer) services for the Muslim community."
        },
        {
            "name": "Kappa Alpha Psi",
            "description": "Kappa Alpha Psi focuses on fellowship, leadership, scholarship, and service."
        },
        {
            "name": "Kappa Phi Gamma",
            "description": "Kappa Phi Gamma Sorority, Inc. promotes cultural diversity and service among its members and community."
        },
        {
            "name": "Kappa Phi Lambda",
            "description": "Kappa Phi Lambda Sorority, Inc. strengthens sisterhood among women through service and cultural diversity."
        },
        {
            "name": "Kappa Sigma Fraternity",
            "description": "Kappa Sigma focuses on fellowship, leadership, scholarship, and service."
        },
        {
            "name": "Karaoke Club (Rutgers)",
            "description": "The Rutgers Karaoke Club provides a fun and inclusive environment for students to showcase their singing talent and build confidence through karaoke."
        },
        {
            "name": "Kendo Sport Club (Rutgers Recreation)",
            "description": "Kendo Sport Club engages students in the Japanese fencing sport of Kendo, promoting competition and skill development."
        },
        {
            "name": "Kidney Disease Screening and Awareness Program (Rutgers)",
            "description": "The Kidney Disease Screening and Awareness Program offers free kidney health screenings and education to underserved communities."
        },
        {
            "name": "Kier's Kidz",
            "description": "Kier’s Kidz supports pediatric cancer patients and families through advocacy, research funding, and bone marrow drives."
        },
        {
            "name": "Kinesiology and Applied Physiology (Graduate Student Organization)",
            "description": "Graduate students in the Rutgers Department of Kinesiology and Applied Physiology collaborate and support each other in their academic pursuits."
        },
        {
            "name": "Kinesiology and Health",
            "description": "The Kinesiology and Health club informs students about career options within the field through support and community."
        },
        {
            "name": "Kirkpatrick Choir (Rutgers University)",
            "description": "Kirkpatrick Choir provides an artistic and social experience through choral music performances and student development."
        },
        {
            "name": "kite+key, Rutgers Tech Store",
            "description": "kite+key, Rutgers Tech Store offers a full line of tech products and services on each Rutgers campus, supporting student and academic needs."
        },
        {
            "name": "Klesis",
            "description": "Klesis is a Christian fellowship for all Rutgers students, focused on connecting with God and each other during college years and beyond."
        },
        {
            "name": "Kodenkan Jujitsu Sport Club (Rutgers Recreation)",
            "description": "Kodenkan Jujitsu, also known as Danzan Ryu Jujitsu, teaches traditional Japanese martial arts emphasizing balance and movement over strength."
        },
        {
            "name": "Kol Halayla",
            "description": "Kol Halayla is the premier Jewish A Cappella group at Rutgers University."
        },
        {
            "name": "Korean Christian Fellowship",
            "description": "Korean Christian Fellowship is a community for Christians and non-Christians to build intentional, fruitful relationships that glorify God."
        },
        {
            "name": "Korean Graduate Student Association (Graduate Organization)",
            "description": "RKGSA represents the Korean graduate student community at Rutgers through social programs and support initiatives."
        },
        {
            "name": "Korean Language Club",
            "description": "Korean Language Club facilitates practice and development of Korean language skills in an academic yet relaxed setting."
        },
        {
            "name": "Korean Students Association",
            "description": "Rutgers Korean Students Association serves as a voice for the Korean community, promoting cultural understanding and awareness."
        },
        {
            "name": "Korean-American Scientists and Engineers Association",
            "description": "KSEA-Rutgers chapter provides networking opportunities and supports growth for members in science and engineering fields."
        },
        {
            "name": "La Unidad Latina, Lambda Upsilon Lambda Fraternity, Inc. - IOTA Chapter",
            "description": "La Unidad Latina addresses the needs of Latino students in higher education through academic and community initiatives."
        },
        {
            "name": "Lacrosse Men’s Sport Club (Rutgers Recreation)",
            "description": "Rutgers Men’s Club Lacrosse team offers opportunities for lacrosse enthusiasts to compete and engage with the sport."
        },
        {
            "name": "Lacrosse Women’s Sport Club (Rutgers Recreation)",
            "description": "Rutgers Women’s Club Lacrosse team provides opportunities for players of all levels to participate and enjoy the sport."
        },
        {
            "name": "Lambda Kappa Sigma",
            "description": "Lambda Kappa Sigma is an international pharmacy fraternity dedicated to advancing women in pharmacy through ethics, professionalism, and sisterhood."
        },
        {
            "name": "Lambda Tau Omega",
            "description": "Lambda Tau Omega Sorority, Inc. promotes service, diversity, and confidence among its members."
        },
        {
            "name": "Lambda Theta Alpha",
            "description": "Lambda Theta Alpha Sorority, Inc. promotes excellence through unity, knowledge, and dedication."
        },
        {
            "name": "Lambda Theta Phi, Latin Fraternity, Inc",
            "description": "Lambda Theta Phi is a Latin fraternity dedicated to brotherhood, scholarship, and service."
        },
        {
            "name": "Landscape Architecture Club (Rutgers Student Chapter of the ASLA)",
            "description": "The Landscape Architecture Club enriches education with professional events, collaborations, and community involvement."
        },
        {
            "name": "Landscape Architecture Graduate Student Association (Graduate Organization)",
            "description": "LAGSA supports social, cultural, and academic interests of graduate students in Landscape Architecture, representing the ASLA student chapter."
        },
        {
            "name": "Latin American Student Organization",
            "description": "LASO develops cultural understanding and global education through entertaining and educational activities."
        },
        {
            "name": "Latin American Womyn's Organization",
            "description": "Latin American Womyn’s Organization advances and empowers women on campus through coalition building and support."
        },
        {
            "name": "Latin Images: College Ave Campus",
            "description": "Latin Images provides a home away from home for Latino students at Rutgers College, fostering community and cultural identity."
        },
        {
            "name": "Latinas Promoviendo Comunidad/Lambda Pi Chi Sorority, Inc.",
            "description": "Lambda Pi Chi Sorority, Inc. promotes community improvement, professional success, and cultural awareness."
        },
        {
            "name": "Latino America Unida | Lambda Alpha Upsilon Fraternity, Inc.",
            "description": "Lambda Alpha Upsilon Fraternity promotes brotherhood, scholarship, and community service among Latino professionals."
        },
        {
            "name": "Latino Student Council",
            "description": "Latino Student Council represents Latino organizations at Rutgers, striving for the success of the Latin American community."
        },
        {
            "name": "Latinos Siempre Unidos, Lambda Sigma Upsilon Latino Fraternity, Incorporated",
            "description": "Lambda Sigma Upsilon Fraternity advocates for minority student rights and community service."
        },
        {
            "name": "Latinx Pre-Law Society",
            "description": "Latinx Pre-Law Society unifies Latinx students pursuing legal careers through support and educational opportunities."
        },
        {
            "name": "League of Legends",
            "description": "The League of Legends organization brings together Rutgers gamers for gameplay and community engagement."
        },
        {
            "name": "Learn and Go Podcast (Rutgers)",
            "description": "Rutgers Learn and Go Podcast creates educational podcast episodes for students to continue learning while traveling around campus."
        },
        {
            "name": "Learning Centers",
            "description": "The Learning Centers offer peer-led academic support services to Rutgers students, enhancing academic performance and success."
        },
        {
            "name": "Legwork for Lungs",
            "description": "Legwork for Lungs hosts an annual 5k and mile walk event to raise funds for lung cancer research at Memorial Sloan Kettering Cancer Center."
        },
        {
            "name": "Liberated Gospel Choir",
            "description": "Liberated Gospel Choir seeks spiritual growth and cohesion through gospel music and community building."
        },
        {
            "name": "Linguistics Club (Rutgers University)",
            "description": "The Linguistics Club inspires interest in linguistics and related fields among Rutgers students, hosting events and activities."
        },
        {
            "name": "Linguistics Graduate Student Association (Graduate Organization)",
            "description": "LGSA represents graduate students in the Department of Linguistics at Rutgers, discussing issues and organizing events."
        },
        {
            "name": "Literary Studies in Spanish Organization (Graduate Organization)",
            "description": "The Literary Studies in Spanish Organization fosters understanding of Latin American cultures through academic events and cultural exploration."
        },
        {
            "name": "Little Investment Bankers of Rutgers",
            "description": "LIBOR is a student-run finance organization preparing students for careers in financial services, focusing on 'front-office' positions on Wall Street."
        },
        {
            "name": "Living-Learning Community Advisory Council - Office of Residential Life (University Department)",
            "description": "The LLC Advisory Council promotes positive change and connection across Rutgers' Living-Learning Communities through events and initiatives."
        },
        {
            "name": "Living-Learning Community Peer Mentors",
            "description": "LLC Peer Mentors support the academic and professional development of their residents within Rutgers' Living-Learning Communities."
        },
        {
            "name": "Livingston Social Justice and Service Learning Community (IMPACT): Livingston Campus",
            "description": "IMPACT at Livingston Campus educates and prepares students to become social justice advocates through co-curricular programs and community service."
        },
        {
            "name": "Livingston Theatre Company",
            "description": "LTC produces multiple musical theater productions each academic year for Rutgers University and the surrounding community."
        },
        {
            "name": "LLEGO: The LGBTQQIA People of Color Organization at Rutgers",
            "description": "LLEGO addresses social, economic, political, and educational issues affecting LGBTQIA people of color through advocacy and community engagement."
        },
        {
            "name": "Magic the Gathering",
            "description": "Magic the Gathering club at Rutgers University where players meet weekly to play, teach, and enjoy the game."
        },
        {
            "name": "Malayali Association at Rutgers",
            "description": "The Malayali Association unites students to educate about Kerala's cultural heritage and promotes awareness about Asian environmental, social, and cultural issues."
        },
        {
            "name": "Marathi Origin Rutgers Youth Association",
            "description": "MORYA promotes Marathi culture and history through activities and events at Rutgers and in the New Jersey community."
        },
        {
            "name": "MARK Conference",
            "description": "MARK Conference is America’s largest student-run leadership event, hosted by Rutgers Office of Student Involvement and Leadership."
        },
        {
            "name": "Martial Arts Sport Club (Rutgers Recreation)",
            "description": "The Martial Arts Sport Club teaches striking martial arts techniques including Muay Thai, Boxing, Karate, Taekwondo, and MMA."
        },
        {
            "name": "Mason Gross School of Art, Visual Art (Graduate Organization)",
            "description": "Mason Gross School of Art Graduate Organization engages MFA students in creative practice, ideas, and learning."
        },
        {
            "name": "Mason Gross School of the Arts - Dance",
            "description": "The Dance Department at Mason Gross School of the Arts promotes excellence in dance performance, creative achievement, and research."
        },
        {
            "name": "Mason Gross Student Governing Association",
            "description": "The Mason Gross Student Governing Association enhances education and promotes interdisciplinary collaboration among students in the arts."
        },
        {
            "name": "Material Advantage",
            "description": "Material Advantage supports undergraduate and graduate students in materials science and engineering through professional development and networking."
        },
        {
            "name": "Materials Science and Engineering Graduate Student Association (Graduate Organization)",
            "description": "The Materials Science and Engineering Graduate Student Association fosters social, cultural, and academic interests of graduate students in the field."
        },
        {
            "name": "Mathematical Graduate Student Association (Graduate Student Organization)",
            "description": "The Mathematical Graduate Student Association organizes academic seminars and events for graduate students interested in mathematics at Rutgers."
        },
        {
            "name": "MedicZero",
            "description": "MedicZero educates members about evidence-based medicine and prehospital care, impacting healthcare at Rutgers and in NJ communities."
        },
        {
            "name": "Meditation Club",
            "description": "The Meditation Club fosters a community for practicing various forms of meditation, promoting self-understanding and spiritual growth."
        },
        {
            "name": "Medium (The)",
            "description": "The Medium is a weekly entertainment publication created by students at Rutgers University."
        },
        {
            "name": "Meetings and Events Office (Student Centers)",
            "description": "The Meetings and Events Office assists student organizations in reserving space at the Student Centers for meetings, events, and special occasions."
        },
        {
            "name": "Mental Health Committee GSA (Graduate Organization)",
            "description": "The Mental Health Committee advocates for mental health support and initiatives for graduate students at Rutgers University."
        },
        {
            "name": "Meteorology Club at Rutgers University",
            "description": "The Meteorology Club at Rutgers serves as the university's local chapter of AMS and NWA, promoting weather awareness and education."
        },
        {
            "name": "METÁFORA: Arte, Performance y Creación en Español (Graduate Organization)",
            "description": "METÁFORA explores Spanish language and culture through art-making such as painting, sculpting, writing, dancing, and singing."
        },
        {
            "name": "Mexican American Student Association",
            "description": "The Mexican American Student Association supports and empowers Mexican American students while promoting cultural understanding and community outreach."
        },
        {
            "name": "MGSA BIPOC Student Organization",
            "description": "MGSA BIPOC Student Org integrates BIPOC influences and artists in Rutgers' arts disciplines, providing support and platforms for student artists."
        },
        {
            "name": "Milana - Kannada Association at Rutgers",
            "description": "Milana connects Kannada-speaking students and those interested in Kannada culture through events that raise awareness about Karnataka's language and culture."
        },
        {
            "name": "Mind and Media",
            "description": "Mind and Media explores film through a psychiatry lens, encouraging members to contribute to a weekly blog and collaborate on film projects."
        },
        {
            "name": "Minorities in Agriculture, Natural Resources and Related Sciences (The Rutgers)",
            "description": "RU-MANRRS promotes inclusivity and career opportunities for students in agricultural and related sciences through internships, research programs, and professional development."
        },
        {
            "name": "Minority Association of Pre-Health Students",
            "description": "The Minority Association of Pre-Health Students supports underrepresented students pursuing careers in healthcare through knowledge, skills, and experiences."
        },
        {
            "name": "Minority Engineering Educational Task",
            "description": "MEET promotes minority retention in engineering by enhancing professionalism and academic success among members."
        },
        {
            "name": "Minority Men in Medicine",
            "description": "This organization provides academic and social support to increase the number of underrepresented minority men from Rutgers matriculating into medical school."
        },
        {
            "name": "Mobile Application Development (Rutgers)",
            "description": "RUMAD teaches Rutgers CS students about mobile app development, encouraging them to create and share apps."
        },
        {
            "name": "Mock Trial Association (Rutgers University)",
            "description": "Rutgers Mock Trial enhances public speaking, debate, and analytical skills through competitive trial simulations."
        },
        {
            "name": "Molecular Biology and Biochemistry Society",
            "description": "The society promotes information exchange among those interested in Biochemistry and Molecular Biology at Rutgers."
        },
        {
            "name": "Molecular Biosciences (Graduate Student Organization)",
            "description": "The Molecular Biosciences GSO enriches the experiences of graduate students affiliated with MBS programs through various activities."
        },
        {
            "name": "Moot Court Association (Rutgers)",
            "description": "Moot Court prepares students interested in law and advocacy through simulated appellate court trials and intensive case law study."
        },
        {
            "name": "Mounted Patrol",
            "description": "The Mounted Patrol organizes the Community Service Officer program's Mounted Patrol division."
        },
        {
            "name": "Mu Beta Psi",
            "description": "Mu Beta Psi is a national honorary musical fraternity."
        },
        {
            "name": "Muggle Mayhem",
            "description": "The Rutgers Chapter of the Harry Potter Alliance uses the Harry Potter universe to promote real-world change and community through games and activities."
        },
        {
            "name": "Multicultural Greek Council",
            "description": "MGC promotes cultural understanding, trust, and friendship among culturally based Greek-lettered sororities and fraternities at Rutgers."
        },
        {
            "name": "Muscle Building Club",
            "description": "The Muscle Building Club supports individuals new or experienced in lifting, fostering motivation and consistency in fitness goals."
        },
        {
            "name": "Musician's Guild AKA Band Union (Rutgers University)",
            "description": "The Musician's Guild provides support for students interested in music performance, regardless of affiliation with Mason Gross School of the Arts."
        },
        {
            "name": "Muslim Feminists for the Arts",
            "description": "Muslim Feminists for the Arts uses arts to educate about Islamic feminism and challenge misogynistic cultural norms."
        },
        {
            "name": "Muslim Public Relations Council",
            "description": "The Muslim Public Relations Council represents Rutgers' Muslim community by maintaining active communication with the university and community."
        },
        {
            "name": "Muslim Student Association",
            "description": "The Rutgers University Muslim Student Association provides a welcoming environment with a focus on Islamic faith."
        },
        {
            "name": "NAACH (RU)",
            "description": "Rutgers Naach promotes South Asian cultural awareness through traditional Indian dance competitions and charitable contributions."
        },
        {
            "name": "NABA, Inc. Rutgers New Brunswick Chapter” (NABA)",
            "description": "NABA provides a network for Black students interested in business, fostering enrichment and support through networking and professional development."
        },
        {
            "name": "National Association for the Advancement of Colored People",
            "description": "The NAACP uplifts minority communities and advocates for social, political, economic, educational, and cultural advancement."
        },
        {
            "name": "National Black Law Students Association-Pre Law Division",
            "description": "NBLSA aims to increase culturally responsible Black and minority attorneys through academic excellence, professional success, and community impact."
        },
        {
            "name": "National Pan-Hellenic Council",
            "description": "NPHC promotes unity and supports historically African American Greek-lettered sororities and fraternities at Rutgers University."
        },
        {
            "name": "National Residence Hall Honorary",
            "description": "NRHH is a leadership-based honorary comprised of exemplary residential students who value service and recognition."
        },
        {
            "name": "National Society of Collegiate Scholars",
            "description": "NSCS recognizes and celebrates high achievement among first and second-year students across all academic disciplines, promoting scholarship, leadership, and service."
        },
        {
            "name": "National Society of Leadership and Success",
            "description": "NSLS creates a support group to help college students achieve their goals and improve their lives through leadership development."
        },
        {
            "name": "Natura: The Science and Epistemology Working Group (Graduate Organization)",
            "description": "Natura fosters interdisciplinary conversations about science, epistemology, and knowledge production among graduate students."
        },
        {
            "name": "Natya",
            "description": "Natya promotes Classical Indian dance and cultural awareness among Rutgers students."
        },
        {
            "name": "Nehriyan Bhangra",
            "description": "Rutgers University's Only All Girls Bhangra Team, promoting the art of Bhangra and providing a network for students passionate about dance."
        },
        {
            "name": "Network 8 Collective",
            "description": "Network 8 Collective unites motivated individuals through artistic collaborative projects aimed at positive community impact."
        },
        {
            "name": "Neuroscience/ Neuroconnections (Graduate Organization)",
            "description": "Neuroconnections Club unites graduate students in the Rutgers Neuroscience Program to foster academic and social connections."
        },
        {
            "name": "New Jersey Public Health Association Rutgers Student Chapter",
            "description": "The NJPHA Rutgers Student Chapter advances public health causes within the Rutgers community and across New Jersey."
        },
        {
            "name": "NJPIRG",
            "description": "NJPIRG Student Chapters runs grassroots advocacy campaigns to address various social and environmental issues."
        },
        {
            "name": "North American Society for Trenchless Technology (Rutgers University Student Chapter)",
            "description": "This student chapter engages engineering students in advancements and applications of trenchless technology through technical learning and site visits."
        },
        {
            "name": "NORU (Rutgers University)",
            "description": "NORU is a K-pop club fostering a friendly environment for students interested in Korean pop music."
        },
        {
            "name": "Not Just Yoga",
            "description": "Not Just Yoga promotes a stress-free and violence-free campus through yoga, meditation, leadership, and service activities."
        },
        {
            "name": "NSO: Incoming Students 2020-2021",
            "description": "This group supports incoming students for the academic year starting September 2020 and January 2021, providing resources and community."
        },
        {
            "name": "Nu Alpha Phi",
            "description": "Nu Alpha Phi is an Asian-interest social fraternity focusing on self-development and community impact through service."
        },
        {
            "name": "Nu Rho Psi",
            "description": "Nu Rho Psi encourages careers in brain science and prepares students for induction into the national honor society."
        },
        {
            "name": "Nutrition Club of Rutgers University",
            "description": "The Nutrition Club promotes nutrition-based discussions, education workshops, and health improvement among students."
        },
        {
            "name": "Nutritional Sciences (Graduate Student Organization)",
            "description": "This organization provides professional and social opportunities for graduate students in the Nutritional Sciences program at Rutgers."
        },
        {
            "name": "O Beta Alpha Kappa Omicron Nu",
            "description": "Kappa Omicron Nu is a national honor society recognizing excellence in scholarship, research, and leadership in family and consumer sciences."
        },
        {
            "name": "Oceanography Club",
            "description": "The Oceanography Club provides a platform for students interested in marine sciences to discuss, socialize, and participate in water-based activities."
        },
        {
            "name": "Oceanography Graduate Student Association (Graduate Organization)",
            "description": "The Oceanography Graduate Student Association organizes seminars, meetings, and social events for graduate students studying marine and coastal sciences."
        },
        {
            "name": "Off-Campus Living and Community Initiatives",
            "description": "Rutgers University's Off-Campus Living and Community Initiatives support students interested in living off-campus with resources and educational programs."
        },
        {
            "name": "Office for Violence Prevention and Victim Assistance (Rutgers University)",
            "description": "VPVA at Rutgers works to create a violence-free community through direct services, education, training, and policy development."
        },
        {
            "name": "Office of Disability Services (University Department)",
            "description": "The Office of Disability Services provides academic accommodations and support for students with disabilities at Rutgers University."
        },
        {
            "name": "Office of Distinguished Fellowships (University Department)",
            "description": "The Office of Distinguished Fellowships assists undergraduates and alumni in applying for competitive, merit-based awards external to Rutgers University."
        },
        {
            "name": "Office of Leadership & Experiential Learning",
            "description": "The Office of Leadership & Experiential Learning designs experiential programs to cultivate confidence, provoke thought, and inspire action among Rutgers students and staff."
        },
        {
            "name": "Office of Summer & Winter Sessions at Rutgers University",
            "description": "Rutgers University's Summer & Winter Sessions offer intensive courses to help students advance toward their academic goals."
        },
        {
            "name": "Office of Veteran and Military Programs and Services",
            "description": "OVMPS supports Rutgers' military-affiliated community by providing a supportive environment and resources."
        },
        {
            "name": "Omega Chi Epsilon",
            "description": "Omega Chi Epsilon is the national honor society for Chemical Engineering students, recognizing academic excellence."
        },
        {
            "name": "Omega Phi Alpha",
            "description": "Omega Phi Alpha is a national service sorority committed to leadership, service, and academic excellence."
        },
        {
            "name": "Omega Phi Beta",
            "description": "Omega Phi Beta Sorority, Incorporated promotes sisterhood, diversity, leadership, service, and academic excellence among its members."
        },
        {
            "name": "Omega Phi Chi Multicultural Sorority, Inc.",
            "description": "Omega Phi Chi is a multicultural sorority promoting ethnic diversity, academic excellence, leadership, and community involvement."
        },
        {
            "name": "Omega Psi Phi",
            "description": "Omega Psi Phi fraternity at Rutgers University."
        },
        {
            "name": "One Health Club",
            "description": "The One Health Club educates students on the interconnectedness of human, animal, and environmental health through initiatives, research, and advocacy."
        },
        {
            "name": "Organization of Cloud Computing at Rutgers",
            "description": "The Organization of Cloud Computing at Rutgers provides a forum for students interested in cloud computing to discuss, debate, and socialize over industry knowledge and skills."
        },
        {
            "name": "Organization of Luso-Americans at Rutgers",
            "description": "A student organization for individuals interested in learning about and discussing Luso-American cultures."
        },
        {
            "name": "OrphanSporks",
            "description": "OrphanSporks is a co-ed a cappella group at Rutgers that performs popular music, improves musical abilities, and competes both on and off-campus."
        },
        {
            "name": "Orthodox Christian Campus Ministries",
            "description": "Promotes awareness of the Oriental Orthodox Christian faith within the Rutgers community."
        },
        {
            "name": "Orthodox Christian Campus Ministries (Chaplaincy)",
            "description": "Serves the Orthodox Christian community at Rutgers through spiritual support and activities."
        },
        {
            "name": "oSTEM at Rutgers",
            "description": "Provides services and support for LGBTQ+ students in Science, Technology, Engineering, and Mathematics fields at Rutgers."
        },
        {
            "name": "Out in Tech @ Rutgers",
            "description": "Creates an inclusive community for LGBTQ+ individuals and allies pursuing degrees in tech and related industries at Rutgers, offering educational, mentorship, and leadership opportunities."
        },
        {
            "name": "Outdoors Club (Rutgers University)",
            "description": "Provides opportunities for Rutgers students to enjoy and learn from nature through various outdoor activities."
        },
        {
            "name": "Overwatch (Rutgers)",
            "description": "Rutgers Overwatch club provides a community for players of all skill levels, offering both casual and competitive gaming experiences."
        },
        {
            "name": "Oxfam Rutgers",
            "description": "Dedicated to raising awareness about hunger, poverty, and social injustices worldwide within the Rutgers University community."
        },
        {
            "name": "Pakistani Student Association",
            "description": "Promotes Pakistani culture and traditions to all interested individuals at Rutgers University."
        },
        {
            "name": "Palestine Children's Relief Fund of Rutgers",
            "description": "Raises awareness and supports children facing unique challenges in the Middle East, remaining non-political and non-religious."
        },
        {
            "name": "Panhellenic Council",
            "description": "Programs and governs sororities at Rutgers University, enriching the community through service and uniting members."
        },
        {
            "name": "Partners In Health Engage of Rutgers University",
            "description": "Advocates for global health equity by establishing healthcare systems in impoverished countries, under the guidance of Partners In Health."
        },
        {
            "name": "Paul Robeson Cultural Center",
            "description": "Offers programs and services reflecting the history, heritage, and diversity of the African diaspora."
        },
        {
            "name": "Peace is Possible",
            "description": "Creates a safe space for discussions on the Israeli-Palestinian conflict, aiming to foster understanding and bridge communities."
        },
        {
            "name": "Peer Academic Leaders",
            "description": "PALs are high-achieving Douglass students who serve as academic advisors, mentors, and ambassadors within the community."
        },
        {
            "name": "Pencils of Promise",
            "description": "Dedicated to providing educational opportunities through grassroots initiatives, focusing on building schools and increasing educational access."
        },
        {
            "name": "Performing Dance Company Sport Club (Rutgers Recreation)",
            "description": "Completely student-run sports club offering a variety of dance styles and levels."
        },
        {
            "name": "Period Equity Project (Rutgers)",
            "description": "Aims to serve, educate, and advocate for menstrual equity within the Rutgers community."
        },
        {
            "name": "Persian Cultural Club (Rutgers)",
            "description": "Promotes Persian culture through events and activities, enhancing student involvement at Rutgers University."
        },
        {
            "name": "Peruvian American Student Association",
            "description": "Empowers and unites Peruvian and Peruvian-Americans at Rutgers while educating others about Peruvian culture and traditions."
        },
        {
            "name": "Petey Greene (Rutgers)",
            "description": "Volunteers provide tutoring to incarcerated individuals, educating volunteers on issues within the carceral system."
        },
        {
            "name": "Pharmaceutics GSO (Graduate Organization)",
            "description": "Represents graduate students in the Pharmaceutical Science Graduate Program at the Ernest Mario School of Pharmacy."
        },
        {
            "name": "Phi Alpha Delta",
            "description": "Pre-law fraternity promoting professional development and camaraderie among members."
        },
        {
            "name": "Phi Beta Sigma",
            "description": "Promotes brotherhood, scholarship, and service among members, founded on principles of inclusion."
        },
        {
            "name": "Phi Chi Theta",
            "description": "Co-ed Professional Business Fraternity focusing on business, economics, HR, and computer science majors/minors."
        },
        {
            "name": "Phi Delta Chi",
            "description": "Oldest and largest co-educational pharmacy fraternity supporting the advancement of pharmacy and allied interests."
        },
        {
            "name": "Phi Delta Epsilon",
            "description": "Rutgers' only co-ed pre-med fraternity, supporting students pursuing careers in medicine."
        },
        {
            "name": "Phi Gamma Delta",
            "description": "Diverse fraternity dedicated to community service, intellectual pursuit, and personal growth."
        },
        {
            "name": "Phi Kappa Psi",
            "description": "Fraternity promoting service, community involvement, and moral and intellectual excellence among members."
        },
        {
            "name": "Phi Kappa Tau",
            "description": "Champions a lifelong commitment to brotherhood, learning, ethical leadership, and exemplary character."
        },
        {
            "name": "Phi Mu Delta",
            "description": "A social fraternity seeking men of high character committed to brotherhood, service, and democracy."
        },
        {
            "name": "Phi Mu Fraternity",
            "description": "A women's organization promoting personal and academic development, service, and lifelong friendship."
        },
        {
            "name": "Phi Sigma Kappa",
            "description": "A social fraternity emphasizing Brotherhood, Scholarship, and Character as cardinal principles."
        },
        {
            "name": "Phi Sigma Pi",
            "description": "A professional gender-inclusive honor fraternity focusing on scholarship, leadership, and fellowship."
        },
        {
            "name": "Phi Sigma Rho",
            "description": "National social sorority for engineering and STEM-related fields."
        },
        {
            "name": "Phi Sigma Sigma",
            "description": "Internationally recognized organization promoting leadership, service, and diversity among women."
        },
        {
            "name": "Phi Sigma Tau, National Honor Society in Philosophy",
            "description": "Encourages interest in philosophy and fosters community among philosophy students."
        },
        {
            "name": "Philosophy Club (Rutgers University)",
            "description": "Educates Rutgers community members about various areas of philosophy through lectures and activities."
        },
        {
            "name": "Philosophy GSO (Graduate Organization)",
            "description": "Hosts events and supports reading groups for graduate students in philosophy."
        },
        {
            "name": "Photography Club (Rutgers)",
            "description": "Community for photographers at Rutgers University to share their passion and skills."
        },
        {
            "name": "Physical Therapy Club (Rutgers)",
            "description": "Provides practical knowledge and expertise related to physical therapy careers."
        },
        {
            "name": "Physics and Astronomy (Graduate Organization)",
            "description": "Promotes social, cultural, and academic interests among graduate students in physics and astronomy."
        },
        {
            "name": "Pi Kappa Phi",
            "description": "Fraternity fostering service, community involvement, and personal development among members."
        },
        {
            "name": "Pi Sigma Alpha",
            "description": "Fosters community among accomplished juniors and seniors studying political science."
        },
        {
            "name": "Pi Tau Sigma",
            "description": "International Mechanical Engineering Honor Society chapter at Rutgers University."
        },
        {
            "name": "Pickleball Sports Club (Rutgers Recreation)",
            "description": "Offers coaching and opportunities for pickleball enthusiasts at Rutgers."
        },
        {
            "name": "Pilot Me (RU)",
            "description": "Community service-oriented organization enriching youth in the Rutgers community."
        },
        {
            "name": "Pokemon Club",
            "description": "Establishes a community of Pokemon fans at Rutgers University."
        },
        {
            "name": "Polish Club",
            "description": "Provides cultural, religious, and educational experiences related to Poland for Rutgers students."
        },
        {
            "name": "Political Science Graduate Student Association (Graduate Organization)",
            "description": "Graduate society for political science students at Rutgers University."
        },
        {
            "name": "Powerlifting Sport Club (Rutgers Recreation)",
            "description": "Supports development and success in powerlifting through coaching and resources."
        },
        {
            "name": "Praise Emmaus Ministry",
            "description": "On-campus ministry preparing students for spiritual encounters and community service."
        },
        {
            "name": "Pre PA Club (Rutgers)",
            "description": "Guides students interested in the physician assistant profession, providing insights and support."
        },
        {
            "name": "Pre-College Initiatives & College Success",
            "description": "Assists college-bound scholars and local students with access to postsecondary opportunities."
        },
        {
            "name": "Pre-Dental Society of Rutgers University",
            "description": "Provides avenues for students interested in dentistry to learn about dental schools and professions."
        },
        {
            "name": "Pre-health Profession Entrepreneurship Association",
            "description": "Offers pre-health students exposure to entrepreneurship through experiential learning."
        },
        {
            "name": "Pre-Law Society",
            "description": "Provides resources and exploration of law-related fields for Rutgers students and the community."
        },
        {
            "name": "Pre-Optometry Professions Society",
            "description": "Educates and informs members about optometry as a profession, guiding students toward optometry careers."
        },
        {
            "name": "Prescription Drug Abuse and Overprescription Awareness Organization of Rutgers",
            "description": "Raises awareness about prescription drug misuse and overprescription, providing information and support."
        },
        {
            "name": "Professional Development Committee (Student Affairs)",
            "description": "Provides professional development for full-time staff in the Division of Student Affairs."
        },
        {
            "name": "Professional Fraternity Council (PFC)",
            "description": "Coordinates fraternities and sororities representing Academic Honors, Business, Community Service, Engineering, Music, Pharmacy, Pre-Law, and Pre-Med."
        },
        {
            "name": "Professional Science Masters Department (PSM)",
            "description": "Offers the Master of Business & Science (MBS) degree combining science-based coursework with business education."
        },
        {
            "name": "Project Sunshine Rutgers Chapter",
            "description": "Provides educational and recreational activities for children and families facing medical challenges through community service."
        },
        {
            "name": "Psi Chi, The International Honor Society in Psychology (Graduate Organization)",
            "description": "Encourages excellence in scholarship among psychology students and advances the science of psychology."
        },
        {
            "name": "Psychological Society",
            "description": "Provides an open forum for members to learn about psychology through discussion and activities."
        },
        {
            "name": "Psychology Department Social/Health Area (Graduate Organization)",
            "description": "Represents graduate students in the Psychology Department Social/Health Area and offers relevant programming."
        },
        {
            "name": "Public Relations Student Society of America",
            "description": "Educates members about public relations through workshops, panels, and speakers, enhancing their professional development."
        },
        {
            "name": "Public Speaking Organization (Rutgers)",
            "description": "Improves public speaking, critical thinking, and communication skills through competitive speech and performances."
        },
        {
            "name": "Q&A: Queer and Asian",
            "description": "Provides a safe space and community for Asian American Pacific Islander LGBTQ+ students through discussions and programming."
        },
        {
            "name": "Quadball Sport Club (Rutgers Recreation)",
            "description": "Offers co-ed competitive intercollegiate quadball (formerly quidditch) for players of all skill levels."
        },
        {
            "name": "Quantitative Finance Club",
            "description": "Helps Rutgers students break into the quantitative finance industry through education and networking opportunities."
        },
        {
            "name": "Queens Chorale",
            "description": "Provides Rutgers University students with the opportunity to sing and perform music arranged for femme voices."
        },
        {
            "name": "Queer and Christian",
            "description": "Supports students navigating Christian faith and LGBT+ identity in a safe and inclusive environment."
        },
        {
            "name": "Queer Caucus",
            "description": "Umbrella organization for LGBTQ+ community at Rutgers, fostering leadership and community building."
        },
        {
            "name": "Queer Student Alliance of Rutgers University",
            "description": "Provides a safe space for Rutgers University students to discuss and act on issues related to non-normative sexual preferences or identities."
        },
        {
            "name": "Raas and Garba Association",
            "description": "Competes in intercollegiate Raas and Garba dance competitions nationwide, promoting cultural awareness."
        },
        {
            "name": "Racquetball Sport Club (Rutgers Recreation)",
            "description": "Welcomes players of all skill levels for racquetball practices and competitions."
        },
        {
            "name": "Raices Ecuatorianas en America (Rutgers)",
            "description": "Promotes cultural appreciation and community among students interested in Ecuadorian heritage."
        },
        {
            "name": "Rainbow Pines",
            "description": "LGBT+ inclusive group at Douglass Residential College focused on education and support for genderqueer and queer students."
        },
        {
            "name": "Rainbow Six Siege Club (Rutgers)",
            "description": "Provides opportunities for students to compete in collegiate Rainbow Six Siege tournaments."
        },
        {
            "name": "Rainbow Symphony (Rutgers)",
            "description": "Promotes inclusivity through music performance, focusing on works by LGBTQ+ composers and underrepresented voices."
        },
        {
            "name": "Ratio Christi (Chaplaincy)",
            "description": "Provides a venue for exploring Christian faith and religious beliefs in a safe environment."
        },
        {
            "name": "Ratio Christi at Rutgers University",
            "description": "Strengthens Christian faith among Rutgers University students and shares Christ's message with the community."
        },
        {
            "name": "Ravens Booster Club",
            "description": "Advocates for the needs of the Air Force ROTC Cadet Corps through volunteerism and support."
        },
        {
            "name": "Reach Out And Read",
            "description": "Incorporates books into pediatric care to encourage reading among young children in New Brunswick."
        },
        {
            "name": "READ, the Rutgers University Book Club",
            "description": "Engages students in reading and discussing a variety of books across genres and literary themes."
        },
        {
            "name": "Real Estate Club (Rutgers)",
            "description": "Hosts lectures, site visits, and conferences to educate students about real estate and career opportunities."
        },
        {
            "name": "Recreation Sport Clubs (Department at Rutgers)",
            "description": "Offers competitive and instructional recreation opportunities through 57 sport clubs at Rutgers."
        },
        {
            "name": "Red Cross Club",
            "description": "Chapter of the American Red Cross providing leadership opportunities through volunteer activities."
        },
        {
            "name": "Red Pine Ambassadors",
            "description": "Sponsored by Douglass Residential College, provides leadership opportunities and support for students."
        },
        {
            "name": "Reformed University Fellowship",
            "description": "A Christian campus ministry providing a community to experience and extend God's grace."
        },
        {
            "name": "Refugee Health Connection",
            "description": "Educates members on the refugee crisis and supports refugees navigating the U.S healthcare system in Central Jersey."
        },
        {
            "name": "Reilly Douglass Living Learning Community (Douglass WiSE)",
            "description": "Provides community and support for undergraduate women pursuing degrees and careers in Engineering."
        },
        {
            "name": "Residence Hall Association (RHA)",
            "description": "Represents students living in residence halls across all five campuses at Rutgers."
        },
        {
            "name": "Residence Life Student Support (Rutgers University Department)",
            "description": "Provides resources and support for students living on campus at Rutgers University-New Brunswick."
        },
        {
            "name": "Residence Life: Brett Hall, 3rd Floor",
            "description": "Group for residents of Brett Hall's 3rd floor."
        },
        {
            "name": "Residence Life: Busch – Buell/Marvin",
            "description": "Fosters safe and inclusive residential communities on Busch campus."
        },
        {
            "name": "Residence Life: Busch – Silvers",
            "description": "Fosters safe and inclusive residential communities on Busch campus."
        },
        {
            "name": "Residence Life: Busch - Barr and Allen",
            "description": "Fosters safe and inclusive residential communities on Busch campus."
        },
        {
            "name": "Residence Life: Busch - BEST",
            "description": "Engages community members in program participation and events in BEST Hall on Busch campus."
        },
        {
            "name": "Residence Life: Busch - Davidson",
            "description": "Fosters safe and inclusive residential communities on Busch campus."
        },
        {
            "name": "Residence Life: Busch - Mattia and Metzger",
            "description": "Fosters safe and inclusive residential communities on Busch campus."
        },
        {
            "name": "Residence Life: Busch - McCormick and Winkler Suites",
            "description": "Fosters safe and inclusive residential communities on Busch campus."
        },
        {
            "name": "Residence Life: Busch - Thomas, Crosby, Judson and Morrow Suites",
            "description": "Fosters safe and inclusive residential communities on Busch campus."
        },
        {
            "name": "Residence Life: Busch - Richardson/Johnson/Nichols",
            "description": "Fosters safe and inclusive residential communities on Busch campus."
        },
        {
            "name": "Residence Life: College Ave Campus",
            "description": "Facilitates communication throughout the College Ave campus."
        },
        {
            "name": "Residence Life: College Avenue - Bishop Quad",
            "description": "Fosters safe and inclusive residential communities on College Ave campus."
        },
        {
            "name": "Residence Life: College Avenue - Brett Hall",
            "description": "Fosters safe and inclusive residential communities on College Ave campus."
        },
        {
            "name": "Residence Life: College Avenue - Campbell Hall",
            "description": "Fosters safe and inclusive residential communities on College Ave campus."
        },
        {
            "name": "Residence Life: College Avenue - Clothier Hall",
            "description": "Fosters safe and inclusive residential communities on College Ave campus."
        },
        {
            "name": "Residence Life: College Avenue - Demarest Hall",
            "description": "Fosters safe and inclusive residential communities on College Ave campus."
        },
        {
            "name": "Residence Life: College Avenue - Frelinghuysen",
            "description": "Fosters safe and inclusive residential communities on College Ave campus."
        },
        {
            "name": "Residence Life: College Avenue - Hardenbergh Hall",
            "description": "Fosters safe and inclusive residential communities on College Ave campus."
        },
        {
            "name": "Residence Life: College Avenue - Honors College",
            "description": "Fosters safe and inclusive residential communities on College Ave campus."
        },
        {
            "name": "Residence Life: College Avenue - Mettler Hall",
            "description": "Fosters safe and inclusive residential communities on College Ave campus."
        },
        {
            "name": "Residence Life: College Avenue - Sojourner Truth Apartments",
            "description": "Fosters safe and inclusive residential communities on College Ave campus."
        },
        {
            "name": "Residence Life: College Avenue - Stonier Hall",
            "description": "Fosters safe and inclusive residential communities on College Ave campus."
        },
        {
            "name": "Residence Life: College Avenue - Tinsley Hall",
            "description": "Fosters safe and inclusive residential communities on College Ave campus."
        },
        {
            "name": "Residence Life: College Avenue - University Center Apartments",
            "description": "Fosters safe and inclusive residential communities on College Ave campus."
        },
        {
            "name": "Residence Life: Cook/Douglass - Helyar",
            "description": "Fosters safe and inclusive residential communities on Cook/Douglass campus."
        },
        {
            "name": "Residence Life: Cook/Douglass - Henderson",
            "description": "Fosters safe and inclusive residential communities on Cook/Douglass campus."
        },
        {
            "name": "Residence Life: Cook/Douglass - Jameson",
            "description": "Fosters safe and inclusive residential communities on Cook/Douglass campus."
        },
        {
            "name": "Residence Life: Cook/Douglass - Katzenbach Hall",
            "description": "Fosters safe and inclusive residential communities on Cook/Douglass campus."
        },
        {
            "name": "Residence Life: Cook/Douglass - Lippincott Hall",
            "description": "Fosters safe and inclusive residential communities on Cook/Douglass campus."
        },
        {
            "name": "Residence Life: Cook/Douglass - New Gibbons",
            "description": "Fosters safe and inclusive residential communities on Cook/Douglass campus."
        },
        {
            "name": "Residence Life: Cook/Douglass - Newell/Starkey Apartments",
            "description": "Fosters safe and inclusive residential communities on Cook/Douglass campus."
        },
        {
            "name": "Residence Life: Cook/Douglass - Nicholas",
            "description": "Fosters safe and inclusive residential communities on Cook/Douglass campus."
        },
        {
            "name": "Residence Life: Cook/Douglass - Old Gibbons",
            "description": "Fosters safe and inclusive residential communities on Cook/Douglass campus."
        },
        {
            "name": "Residence Life: Cook/Douglass - Perry & Voorhees",
            "description": "Fosters safe and inclusive residential communities on Cook/Douglass campus."
        },
        {
            "name": "Residence Life: Cook/Douglass - Woodbury Bunting-Cobb",
            "description": "Fosters safe and inclusive residential communities on Cook/Douglass campus."
        },
        {
            "name": "Residence Life: Livingston - Livingston Apartments",
            "description": "Fosters safe and inclusive residential communities on Livingston campus."
        },
        {
            "name": "Residence Life: Livingston - Lynton Towers",
            "description": "Fosters safe and inclusive residential communities on Livingston campus."
        },
        {
            "name": "Residence Life: Livingston - Quad I",
            "description": "Fosters safe and inclusive residential communities on Livingston campus."
        },
        {
            "name": "Residence Life: Livingston - Quad II",
            "description": "Fosters safe and inclusive residential communities on Livingston campus."
        },
        {
            "name": "Residence Life: Livingston - Quad III",
            "description": "Fosters safe and inclusive residential communities on Livingston campus."
        },
        {
            "name": "Residence Life: Staff Selection and Training",
            "description": "Provides training and support for residence life staff at Rutgers."
        },
        {
            "name": "Residence Life: Student Support",
            "description": "Provides resources and support for students living on campus at Rutgers University-New Brunswick."
        },
        {
            "name": "Restorative Leaders",
            "description": "A community of students passionate about restorative justice and practices."
        },
        {
            "name": "Rhythm Games Club",
            "description": "Unites fans of rhythm games to discuss, play, and enjoy rhythm-based gaming."
        },
        {
            "name": "Riot Squad (Rutgers)",
            "description": "Official student section supporting Rutgers University sports teams."
        },
        {
            "name": "Rites of Passage Ceremony",
            "description": "Cultural graduation ceremony and celebration for Black and Latinx identified students."
        },
        {
            "name": "Rock Climbing Sport Club (Rutgers Recreation)",
            "description": "Engages students in rock climbing activities and community."
        },
        {
            "name": "Rocket League (Rutgers)",
            "description": "Brings together the Rutgers community for competitive Rocket League gaming."
        },
        {
            "name": "Roll for Initiative: the Rutgers Dungeons & Dragons Club",
            "description": "Provides a space for students to play Dungeons & Dragons and other tabletop roleplaying games."
        },
        {
            "name": "Roller Skating Club (Rutgers)",
            "description": "Fosters a community of roller skaters and rollerbladers at Rutgers University."
        },
        {
            "name": "Ronald McDonald House (Rutgers)",
            "description": "Raises funds and provides service opportunities for the Ronald McDonald House of Central and Northern New Jersey."
        },
        {
            "name": "Rotaract Club",
            "description": "Provides opportunities for personal development and community service for young men and women."
        },
        {
            "name": "Roundnet Sport Club (Rutgers Recreation)",
            "description": "Co-ed recreational or competitive Spikeball club at Rutgers University."
        },
        {
            "name": "Routure Magazine",
            "description": "Provides an outlet for Rutgers University students to express and embrace fashion."
        },
        {
            "name": "RU Curly",
            "description": "Provides a space for sharing healthy hair tips, encouragement, and community service."
        },
        {
            "name": "RU Election 2016 (Federal, State, & Local ElectionInfo Page)",
            "description": "Blank"
        },
        {
            "name": "RU For Choice",
            "description": "Advocates for sexual health and reproductive rights through connections with Planned Parenthood."
        },
        {
            "name": "RU Inclusive",
            "description": "Network for students interested in workplace diversity, equity, and inclusion (DEI)."
        },
        {
            "name": "RU Informs",
            "description": "Educates on management and operations research in Engineering."
        },
        {
            "name": "RU Makers",
            "description": "Fosters a community interested in DIY projects like electronics, 3D printing, and more."
        },
        {
            "name": "RU Origins",
            "description": "Spiritual but not Religious (SBNR) community."
        },
        {
            "name": "RU Progressive",
            "description": "Our Revolution chapter focusing on progressive change through civic education and political action."
        },
        {
            "name": "RU Psyched: The Rutgers Psychedelic Society",
            "description": "Promotes knowledge about the medicinal, historical, and spiritual aspects of entheogenic substances."
        },
        {
            "name": "RU Tamil",
            "description": "Promotes, preserves, and appreciates Tamil culture at Rutgers University."
        },
        {
            "name": "RU Thrifty",
            "description": "Educates about textile waste and promotes sustainable fashion choices through clothing swaps."
        },
        {
            "name": "RU-TV Broadcast Communication Living-Learning Community: Busch Campus",
            "description": "Combines residential living with learning opportunities in broadcast communication."
        },
        {
            "name": "RU-TV Weather Watcher Living-Learning Community: Cook Campus",
            "description": "Produces weather forecasts and science journalism programs for the university’s television network."
        },
        {
            "name": "RUAA Scarlet Council",
            "description": "Inspires students to become engaged and philanthropic alumni of Rutgers University."
        },
        {
            "name": "RUcketlist",
            "description": "Encourages students to experience and achieve a set list of goals during their time at Rutgers."
        },
        {
            "name": "RUEgyptian - Provisional Organization",
            "description": "Promotes awareness and appreciation of Egyptian culture among students."
        },
        {
            "name": "Rugby Men’s Sport Club (Rutgers Recreation)",
            "description": "Competitive rugby team playing at the highest level of collegiate rugby (D1-AA)."
        },
        {
            "name": "Rugby Women’s Sport Club (Rutgers Recreation)",
            "description": "Competes in the Tri-State Rugby Conference at the Division II level."
        },
        {
            "name": "Running Sport Club (Rutgers Recreation)",
            "description": "Welcomes all Rutgers students interested in running, catering to all types and abilities."
        },
        {
            "name": "RUSA Allocations Board",
            "description": "Responsible for allocating funds to student organizations and events at Rutgers University."
        },
        {
            "name": "RUSA Special Session",
            "description": "Private group for special sessions of the Rutgers University Student Assembly (RUSA)."
        },
        {
            "name": "Russian Club",
            "description": "Introduces and celebrates Russian life and culture, open to all."
        },
        {
            "name": "Rutgers 3D Printing Society",
            "description": "Open to students interested in 3D modeling and printing, featuring research, projects, and workshops."
        },
        {
            "name": "Rutgers Association of Toxicology Students (Graduate Organization)",
            "description": "Professional and social organization for graduate students in Toxicology at Rutgers."
        },
        {
            "name": "Rutgers Athletics (Department at Rutgers University)",
            "description": "Provides opportunities for competitive sports, intramurals, and recreational activities."
        },
        {
            "name": "Rutgers Business School-NB Undergraduate Programs (Advising Office)",
            "description": "Provides academic advising and support for undergraduate students at Rutgers Business School."
        },
        {
            "name": "Rutgers College Support Program/Rutgers Center for Adult Autism Services (University Department)",
            "description": "Supports Rutgers students on the autism spectrum throughout their university experience."
        },
        {
            "name": "Rutgers Community Christian Church (Chaplaincy)",
            "description": "Supports students in their spiritual growth and reflection on campus."
        },
        {
            "name": "Rutgers Community Events",
            "description": "Posts events and news from Campus Connect resource."
        },
        {
            "name": "Rutgers Commuter Student Association",
            "description": "Inclusive volunteer organization serving commuter students’ needs and interests."
        },
        {
            "name": "Rutgers Cricket Club (Rutgers Recreation)",
            "description": "Develops high-level cricket opportunities for competitive and recreational play."
        },
        {
            "name": "Rutgers Destiny",
            "description": "Provides a hub and clan for students playing the video game Destiny 2, organizing raids and activities."
        },
        {
            "name": "Rutgers Engineering Honors Council",
            "description": "Represents honors students and societies in the School of Engineering."
        },
        {
            "name": "Rutgers Exposure Science Student Association (Graduate Organization)",
            "description": "Promotes solidarity and student advocacy within the Exposure Science program."
        },
        {
            "name": "Rutgers Formula Racing",
            "description": "Designs, builds, and races a formula-style car annually, competing at international levels."
        },
        {
            "name": "Rutgers Geek Week",
            "description": "Annual celebration of all things 'geeky' at Rutgers University."
        },
        {
            "name": "Rutgers Genshin Impact Club",
            "description": "Community for Genshin Impact players, organizing casual events and gameplay."
        },
        {
            "name": "Rutgers Global (Department at Rutgers University)",
            "description": "Leads international and global initiatives across Rutgers University."
        },
        {
            "name": "Rutgers GRADient",
            "description": "Unites LGBT+ graduate students at Rutgers University."
        },
        {
            "name": "Rutgers Graduate Christian Fellowship (Graduate Organization)",
            "description": "Supports Christian graduate students in spiritual growth and community."
        },
        {
            "name": "Rutgers Graduate School of Education (University Department)",
            "description": "Offers bachelor's and master's programs in education with teacher licensure."
        },
        {
            "name": "Rutgers Graduate Students for Rare NORD Chapter",
            "description": "Networks students interested in rare diseases, promoting awareness and advocacy with NORD."
        },
        {
            "name": "Rutgers International Society for Optics and Photonics Student Chapter",
            "description": "Part of SPIE, promoting optics and photonics knowledge and applications."
        },
        {
            "name": "Rutgers Marxists",
            "description": "Discusses and spreads Marxist ideas and theories at Rutgers University."
        },
        {
            "name": "Rutgers National Association for Music Education at Rutgers- Collegiate Chapter",
            "description": "Promotes music education and community among Rutgers students."
        },
        {
            "name": "Rutgers New Brunswick SACNAS (Advancing Chicanos/Hispanics & Native Americans in Science)",
            "description": "Supports underrepresented minorities in science education and careers."
        },
        {
            "name": "Rutgers Overseas Semester Experience (University Department)",
            "description": "Allows first-year students to start at a partner university abroad."
        },
        {
            "name": "Rutgers Packaging Engineering Club",
            "description": "Connects students in packaging engineering for networking and learning."
        },
        {
            "name": "Rutgers Personal Finance Club",
            "description": "Promotes financial literacy and stability among Rutgers students."
        },
        {
            "name": "Rutgers Recreation (Department at Rutgers)",
            "description": "Offers recreational activities and promotes student well-being."
        },
        {
            "name": "Rutgers Republicans",
            "description": "Promotes conservative values and activities on campus."
        },
        {
            "name": "Rutgers Residence Life",
            "description": "Supports safe, comfortable, and inclusive residential communities at Rutgers."
        },
        {
            "name": "Rutgers Residence Life Living-Learning Communities",
            "description": "Provides specialized residential communities focusing on academic and social themes."
        },
        {
            "name": "Rutgers Review (The)",
            "description": "Arts & culture magazine at Rutgers University."
        },
        {
            "name": "Rutgers School of Social Work Graduate Student Association (Graduate Organization)",
            "description": "Supports social work graduate students in academic and professional pursuits."
        },
        {
            "name": "Rutgers Seeding Labs (Graduate Organization)",
            "description": "Empowers scientists in developing countries through resource support."
        },
        {
            "name": "Rutgers Solar Car Team",
            "description": "Designs and races a solar-powered vehicle, promoting engineering excellence."
        },
        {
            "name": "Rutgers Student Centers - Student Staff",
            "description": "Group for student staff members working in Rutgers Student Centers."
        },
        {
            "name": "Rutgers Taiwanese GSA/Rutgers Taiwan Study Association (Graduate Organization)",
            "description": "Association for Taiwanese graduate students at Rutgers University."
        },
        {
            "name": "Rutgers Transfer Student Association",
            "description": "Provides networking, mentoring, and support for transfer students at Rutgers University."
        },
        {
            "name": "Rutgers University Dance Marathon",
            "description": "Largest student-run philanthropic event in New Jersey supporting Embrace Kids Foundation."
        },
        {
            "name": "Rutgers University for Primate Conservation",
            "description": "Promotes primate conservation through enrichment activities, field trips, speakers, and fundraisers."
        },
        {
            "name": "Rutgers University Jains",
            "description": "Connects Jain students and promotes Jain values and culture on campus."
        },
        {
            "name": "Rutgers University Marching Band",
            "description": "Big 10 marching band representing Rutgers at football games and other events."
        },
        {
            "name": "Rutgers University Musicological Society (Graduate Organization)",
            "description": "Represents graduate students studying musicology, music theory, and composition."
        },
        {
            "name": "Rutgers University Nepalese Student Association",
            "description": "Promotes Nepalese culture through events, meetings, and social media."
        },
        {
            "name": "Rutgers University Programming Association",
            "description": "Student programming council serving the entire Rutgers community."
        },
        {
            "name": "Rutgers University School of Engineering",
            "description": "Provides opportunities for students, researchers, and industry leaders in engineering."
        },
        {
            "name": "Rutgers University SHRM Chapter (Graduate Organization)",
            "description": "Award-winning chapter providing education, networking, and leadership programs in HRM."
        },
        {
            "name": "Rutgers University Student Assembly (RUSA)",
            "description": "Official governing body for undergraduate students at Rutgers, allocating student fee funding."
        },
        {
            "name": "Rutgers University Survivor",
            "description": "Hosts a modified Survivor competition and themed events for students."
        },
        {
            "name": "Rutgers Women in Product",
            "description": "Network for female students interested in product management."
        },
        {
            "name": "Rutgers Women's Wrestling Club (Sports Club)",
            "description": "Provides opportunities for female/nonbinary students to participate in wrestling."
        },
        {
            "name": "S.T.E.M. Ambassadors",
            "description": "Supports women and nonconforming individuals in STEM fields."
        },
        {
            "name": "Sailing Sport Club (Rutgers Recreation)",
            "description": "Competitive sailing club at Rutgers University."
        },
        {
            "name": "Salsa Sport Club (Rutgers Recreation)",
            "description": "Offers salsa lessons and events for students."
        },
        {
            "name": "Sangam - A South Indian Foundation (Rutgers)",
            "description": "Promotes South Indian culture through events and meetings."
        },
        {
            "name": "SAS Honors Program (Rutgers University Department)",
            "description": "Provides honors students with academic and leadership opportunities."
        },
        {
            "name": "SAS Transfer Center",
            "description": "Assists transfer students at Rutgers University with academic planning."
        },
        {
            "name": "Scarlet Anchor Society",
            "description": "Supports naval services and interests among Rutgers students."
        },
        {
            "name": "Scarlet Cross - The Rutgers Medieval History and Reenactment Club",
            "description": "Reenacts Medieval history and culture at Rutgers University."
        },
        {
            "name": "Scarlet Honor Council",
            "description": "Upholds community standards and promotes campus civility at Rutgers."
        },
        {
            "name": "Scarlet Knight News",
            "description": "Broadcasts news and provides journalism experience for students."
        },
        {
            "name": "Scarlet Smash",
            "description": "Promotes interest in Super Smash Bros through tournaments and events."
        },
        {
            "name": "School of Communication and Information Doctoral Student Association",
            "description": "Supports doctoral students in communication and information studies."
        },
        {
            "name": "School of Management and Labor Relations",
            "description": "Provides expertise on work, organizations, and employment relationships."
        },
        {
            "name": "Science Fiction Club (Rutgers)",
            "description": "Brings together fans of science fiction for discussions and activities."
        },
        {
            "name": "Science Policy and Advocacy at Rutgers (Graduate Organization)",
            "description": "Advocates for science communication, evidence-based policy, and inclusivity."
        },
        {
            "name": "SCREAM Theater",
            "description": "Peer educational theater program addressing interpersonal violence."
        },
        {
            "name": "Scuba Diving Club (The Rutgers)",
            "description": "Creates a community for both certified and non-certified divers at Rutgers University."
        },
        {
            "name": "SEBS Governing Council",
            "description": "Represents students at the Rutgers School of Environmental and Biological Sciences."
        },
        {
            "name": "SEBS Office of Academic Programs (Department at Rutgers)",
            "description": "Oversees undergraduate academic programs at the School of Environmental and Biological Sciences."
        },
        {
            "name": "SEBS Office of Global Engagement",
            "description": "Promotes internationalization efforts at SEBS/NJAES."
        },
        {
            "name": "SEBS Pre-Medical/Pre-Dental Society",
            "description": "Provides information and support for students pursuing medical and dental careers."
        },
        {
            "name": "Security Club (Rutgers)",
            "description": "Trains students in ethical hacking and cybersecurity analysis, competes in cybersecurity competitions."
        },
        {
            "name": "Seeing Eye Puppy Raising Club (Rutgers University)",
            "description": "Raises puppies for The Seeing Eye, Inc. to become guide dogs."
        },
        {
            "name": "SGC Allocations Board",
            "description": "Allocates funding from SEBS student fees to student organizations."
        },
        {
            "name": "Shem Productions",
            "description": "Establishes a supportive atmosphere for students to participate in theatre."
        },
        {
            "name": "ShockWave",
            "description": "Network for students who enjoy singing a cappella music and performing."
        },
        {
            "name": "Sigma Alpha Epsilon",
            "description": "Promotes friendship, scholarship, and service among its members."
        },
        {
            "name": "Sigma Beta Rho",
            "description": "Instills leadership qualities, organizes service activities, and raises cultural awareness."
        },
        {
            "name": "Sigma Chi",
            "description": "Brotherhood promoting diversity and leadership among its members."
        },
        {
            "name": "Sigma Delta Tau",
            "description": "National sorority empowering women through scholarship, service, and leadership."
        },
        {
            "name": "Sigma Lambda Beta",
            "description": "Culturally based fraternity providing a fraternal experience and community service opportunities."
        },
        {
            "name": "Sigma Lambda Gamma",
            "description": "Sisterhood focused on personal development, community involvement, and cultural enrichment."
        },
        {
            "name": "Sigma Lambda Upsilon/Señoritas Latinas Unidad Sorority Inc.",
            "description": "Promotes academic excellence, cultural enrichment, and community service for women."
        },
        {
            "name": "Sigma Phi Delta",
            "description": "Fraternity exclusively for male engineering students, fostering leadership and camaraderie."
        },
        {
            "name": "Sigma Phi Epsilon",
            "description": "Redefines fraternity through leadership, personal development, and community service."
        },
        {
            "name": "Sigma Pi",
            "description": "Collegiate fraternal organization promoting leadership, social development, and academic achievement."
        },
        {
            "name": "Sigma Psi Zeta",
            "description": "Multicultural Greek organization supporting women of color and combating domestic violence."
        },
        {
            "name": "Sigma Sigma Rho",
            "description": "Promotes unity among women of South Asian descent and serves society through community initiatives."
        },
        {
            "name": "Sigma Tau Delta",
            "description": "International English Honor Society chapter promoting literary engagement at Rutgers University."
        },
        {
            "name": "Sikh Student Association",
            "description": "Raises awareness of Sikh religion and heritage through cultural, social, and educational activities."
        },
        {
            "name": "Sister2Sister (Rutgers University)",
            "description": "Spreads breast cancer awareness through education, advocacy, and programming."
        },
        {
            "name": "Sisters with Values",
            "description": "Promotes sisterhood, integrity, empowerment, community service, and scholarship among members."
        },
        {
            "name": "Ski/Snowboard Sport Club (Rutgers Recreation)",
            "description": "Competes in freestyle competitions and races as part of the USCSA."
        },
        {
            "name": "Soccer Men’s Sport Club (Rutgers Recreation)",
            "description": "Competitive soccer team participating in league games and tournaments."
        },
        {
            "name": "Soccer Women’s Sport Club (Rutgers Recreation)",
            "description": "Welcomes players of all levels for competitive and recreational soccer."
        },
        {
            "name": "Sociedad Estudiantil Dominicana",
            "description": "Promotes Dominican and Latin culture at Rutgers University."
        },
        {
            "name": "Society for Advancement of Chicanos/Hispanics & Native Americans in Science (Graduate Organization)",
            "description": "Inclusive organization fostering the success of Chicano/Hispanic and Native American scientists in STEM."
        },
        {
            "name": "Society for Human Resources Management Undergraduate Student Chapter (Rutgers University)",
            "description": "Develops HR management leaders among undergraduate students through education and networking."
        },
        {
            "name": "Society for Promotion of Indian Classical Music And Culture Among Youth",
            "description": "Dedicated to conservation and promotion of Indian classical art forms through concerts and demonstrations."
        },
        {
            "name": "Society of Animal Science",
            "description": "Promotes goodwill among those interested in the Animal Sciences."
        },
        {
            "name": "Society of Asian Scientists and Engineers",
            "description": "Advances Asian heritage scientists and engineers in education and employment."
        },
        {
            "name": "Society of Hispanic Engineers",
            "description": "Recruits, retains, and graduates minority students in engineering, math, and science."
        },
        {
            "name": "Society of Latin American Men",
            "description": "Promotes academics, politics, and culture while addressing issues affecting Latino men."
        },
        {
            "name": "Society of Manufacturing Engineers",
            "description": "Provides knowledge sharing and experience in manufacturing for Rutgers students."
        },
        {
            "name": "Society of Physics Students",
            "description": "Supports growth and development of the Rutgers Physics community."
        },
        {
            "name": "Society of Plastics Engineers",
            "description": "Introduces students to plastics industry through networking with professionals."
        },
        {
            "name": "Society of Professional Journalists",
            "description": "Educates members about journalism through workshops, panels, and speakers."
        },
        {
            "name": "Society of Women Engineers",
            "description": "Supports and promotes women in engineering through leadership and diversity."
        },
        {
            "name": "Softball Sport Club (Rutgers Recreation)",
            "description": "Competitive team playing against D1-D3 schools in and out of state."
        },
        {
            "name": "South Asian Performing Artists",
            "description": "Spreads South Asian cultural awareness through various dance styles."
        },
        {
            "name": "South Asians In Legal Studies (Rutgers University)",
            "description": "Unites South Asian students interested in legal studies through community building and networking."
        },
        {
            "name": "South East Asians of Rutgers University",
            "description": "Resource for students interested in Southeast Asia and its culture at Rutgers."
        },
        {
            "name": "Spanish Club (Rutgers)",
            "description": "Creates an inclusive environment for students to improve Spanish speaking skills."
        },
        {
            "name": "Speech and Hearing Club, a NSSLHA Chapter (Rutgers University)",
            "description": "Engages in activities related to speech and hearing disorders, promotes awareness and education."
        },
        {
            "name": "Spoon University Rutgers University Chapter",
            "description": "Provides a platform for students to write, publish, and participate in events related to food."
        },
        {
            "name": "Sports Business Association (The Rutgers)",
            "description": "Fosters interest in sports business through meetings and networking opportunities."
        },
        {
            "name": "Statistics Graduate Student Association (Graduate Organization)",
            "description": "Promotes social, cultural, and academic interests of graduate students in statistics."
        },
        {
            "name": "Student Centers and Activities - Engagement Ambassadors",
            "description": "Student leaders connecting students to engagement and involvement opportunities at Rutgers – New Brunswick."
        },
        {
            "name": "Student College, Academic, and Research Libraries Association (Graduate Organization)",
            "description": "Organizes events, speakers, and workshops to promote understanding of academic librarianship."
        },
        {
            "name": "Student Health (Rutgers) - A University Department",
            "description": "Provides comprehensive clinical care including medical and mental health counseling services."
        },
        {
            "name": "Student Linux User's Group (Rutgers University)",
            "description": "Promotes free software and facilitates discussion and knowledge exchange."
        },
        {
            "name": "Student Organization for Unique and Rare Collections Everywhere (Graduate Organization)",
            "description": "Society of American Archivists Student Chapter at Rutgers promoting unique collections."
        },
        {
            "name": "Student Organization of Academic Research in STEM of Rutgers University",
            "description": "Fosters academic research in STEM fields through resources, workshops, and opportunities."
        },
        {
            "name": "Student Organized Rutgers Against Hunger",
            "description": "Raises awareness and coordinates food drives and fundraising events to combat hunger."
        },
        {
            "name": "Student Society for Stem Cell Research",
            "description": "Advocates for the development of stem cell research."
        },
        {
            "name": "Student Support Services (TRIO)",
            "description": "Federally funded program providing support and resources for student success."
        },
        {
            "name": "Student Veterans Organization (SVO)",
            "description": "Provides fellowship, resources, and advocacy for student veterans at Rutgers New Brunswick."
        },
        {
            "name": "Student Volunteer Engagement (Student Centers and Activities)",
            "description": "Promotes volunteering and community engagement opportunities for Rutgers students."
        },
        {
            "name": "Students for Environmental & Energy Development",
            "description": "Provides knowledge, hands-on experience, and networking in environmental and energy fields."
        },
        {
            "name": "Students for Environmental Awareness",
            "description": "Raises awareness of environmental issues and promotes action among Rutgers students."
        },
        {
            "name": "Students for Justice in Palestine",
            "description": "Addresses social, political, cultural, and human rights issues related to Palestine."
        },
        {
            "name": "Supply Chain Association (Rutgers University)",
            "description": "Connects supply chain students with corporate and academic experiences for professional growth."
        },
        {
            "name": "Supporting Parents and Caregivers at Rutgers (Graduate Organization)",
            "description": "Provides social connections and advocates for grad student parents and caregivers at Rutgers."
        },
        {
            "name": "Suryoyo Organization (Rutgers)",
            "description": "Network for students interested in Syriac culture and heritage, raises awareness about community issues."
        },
        {
            "name": "Swift Society at Rutgers",
            "description": "Creates an environment for Rutgers students to connect over their love for Taylor Swift and her music."
        },
        {
            "name": "Swim Sport Club (Rutgers Recreation)",
            "description": "Competitive coed swim team competing against other college club teams on the East Coast."
        },
        {
            "name": "Swing Dance Club",
            "description": "Inclusive community where students can learn swing dance regardless of experience level."
        },
        {
            "name": "Table Tennis Sport Club (Rutgers Recreation)",
            "description": "Open to undergraduate, graduate, and alumni players of all skill levels."
        },
        {
            "name": "Tae Kwon Do Sport Club (Rutgers Recreation)",
            "description": "Club sport open to all university students interested in Tae Kwon Do."
        },
        {
            "name": "Taiwanese American Student Association",
            "description": "Provides a network for students interested in Taiwanese culture and community."
        },
        {
            "name": "Tamasha (Rutgers)",
            "description": "Co-ed cultural dance experience exposing members to South Asian dance forms."
        },
        {
            "name": "TAMID Group at Rutgers",
            "description": "Consulting and finance club offering hands-on experience through competitions and projects."
        },
        {
            "name": "Tau Beta Pi",
            "description": "National Engineering Honors Society recognizing scholastic achievement and leadership."
        },
        {
            "name": "Tau Epsilon Phi",
            "description": "Social fraternity promoting leadership, academic excellence, and service."
        },
        {
            "name": "TEDx Rutgers University",
            "description": "Builds student-led collaborative experiences through inspirational TEDx events."
        },
        {
            "name": "Tennis Sport Club (Rutgers Recreation)",
            "description": "Co-ed tennis club for students with high school and club experience."
        },
        {
            "name": "Thaakat Foundation",
            "description": "Promotes community service at Rutgers through local and global projects focusing on education and healthcare."
        },
        {
            "name": "The BOLD Center at Douglass for Leadership, Career and Personal Development",
            "description": "Provides leadership, mentoring, career, and personal development programs for Douglass students."
        },
        {
            "name": "The Collaborative Center for Community-Based Research and Service",
            "description": "Multi-disciplinary center dedicated to civic engagement and community-based learning at Rutgers – New Brunswick."
        },
        {
            "name": "The Comic Book Club",
            "description": "Provides a space for fans of comic books and related media to connect and form relationships."
        },
        {
            "name": "The Daily Targum",
            "description": "Student-run newspaper dedicated to providing news coverage to the Rutgers community since 1869."
        },
        {
            "name": "The Daily Targum Referendum",
            "description": "Referendum every three years for Rutgers students to vote on funding for the Daily Targum newspaper."
        },
        {
            "name": "The Examiner: Pre-Health Journal",
            "description": "Student-run pre-health journal at Rutgers University-New Brunswick."
        },
        {
            "name": "The Margery Somers Foster Center (A Rutgers University Department)",
            "description": "Unit of Rutgers University Libraries focused on co-curricular initiatives in visual technology and networked culture."
        },
        {
            "name": "The Plaza at Livingston Campus",
            "description": "Retail and event space hosting various retailers and events for Rutgers students."
        },
        {
            "name": "The Rutgers University Poker Club",
            "description": "Structured network for students interested in poker, hosting educational meetings and poker games."
        },
        {
            "name": "The Space Technology Association of Rutgers",
            "description": "SEDS chapter uniting space enthusiasts across all majors through projects like CubeSatellite and Weather Balloon."
        },
        {
            "name": "The Wildlife Society: Rutgers Student Chapter",
            "description": "Exposes students to careers in wildlife conservation and management through networking and professional development."
        },
        {
            "name": "Theta Tau",
            "description": "Oldest and largest fraternity for engineers promoting service, professionalism, and brotherhood."
        },
        {
            "name": "Toastmasters International, Local Rutgers Chapter #1139161",
            "description": "Provides a supportive environment for students to practice public speaking and leadership skills."
        },
        {
            "name": "Together Educating All Children in Hospitals",
            "description": "Volunteer-run organization providing educational programming to children in hospitals."
        },
        {
            "name": "Traditional Events at Douglass Residential College - DRC",
            "description": "Preserves and celebrates traditions at Douglass Residential College through events like Yule Log and Sacred Path."
        },
        {
            "name": "Traditional Events Committee",
            "description": "Organizes traditional events at Rutgers to build community and foster cultural appreciation."
        },
        {
            "name": "Transmissions",
            "description": "Provides a safe space, network, and resources for transgender students and their allies."
        },
        {
            "name": "True Jesus Church - A Campus Ministry",
            "description": "Provides a forum for students to study the Bible and share applications relevant to the gospel."
        },
        {
            "name": "Turf Club (Rutgers)",
            "description": "Network for students interested in turfgrass science, discussing industry experiences and developments."
        },
        {
            "name": "Turkish Culture Club (Rutgers)",
            "description": "Promotes Turkish cultural awareness through events, speakers, and demonstrations."
        },
        {
            "name": "Turning Point USA at Rutgers University New Brunswick",
            "description": "Conservative organization promoting freedom of speech, fiscal responsibility, and limited government."
        },
        {
            "name": "TWESE, The Organization for African Students and Friends of Africa",
            "description": "Supports academic and cultural integration of African students and friends of Africa at Rutgers."
        },
        {
            "name": "Tyler Clementi Center for Diversity Education and Bias Prevention - TCC (University Department)",
            "description": "Promotes understanding and engagement on diversity and bias prevention issues at Rutgers."
        },
        {
            "name": "Ukrainian Students Club (Rutgers)",
            "description": "Promotes Ukrainian cultural awareness through activities, language promotion, and community building."
        },
        {
            "name": "Ultimate Frisbee Men’s Sport Club (Rutgers Recreation)",
            "description": "Competitive club representing Rutgers in collegiate Ultimate frisbee."
        },
        {
            "name": "Ultimate Frisbee Womxn’s Sport Club (Rutgers Recreation)",
            "description": "Competitive gender-inclusive Ultimate frisbee team at Rutgers."
        },
        {
            "name": "Ultra Violet",
            "description": "Community-based discussion group for LBGTQA+ non-men, meeting weekly at the SJE building."
        },
        {
            "name": "Undergraduate Anthropology Club (Rutgers)",
            "description": "Explores anthropology through discussions on human history, cultures, and societies."
        },
        {
            "name": "Undergraduate Food Science Club",
            "description": "Brings together food science majors and enthusiasts for career development and fun activities."
        },
        {
            "name": "Undergraduate Geography Society (Rutgers)",
            "description": "Promotes knowledge and understanding of geography among Rutgers undergraduate students."
        },
        {
            "name": "Undergraduate Mathematics Association",
            "description": "Fosters professional growth and interest in mathematics among Rutgers undergraduate students."
        },
        {
            "name": "Undergraduate Social Work Organization",
            "description": "Network for students interested in public service through social work in New Jersey."
        },
        {
            "name": "Undergraduate Society of History (Rutgers)",
            "description": "Promotes history education and community among history majors and enthusiasts."
        },
        {
            "name": "Undergraduate Student Alliance of Computer Scientists",
            "description": "Supports Rutgers' Computer Science students academically, socially, and professionally."
        },
        {
            "name": "Undergraduate Students for the Plant Sciences at Rutgers",
            "description": "Network for students interested in plant sciences to share their passion and career aspirations."
        },
        {
            "name": "Undergraduate Women in Business (Rutgers)",
            "description": "Student-led organization promoting female empowerment, professional development, and growth."
        },
        {
            "name": "UndocuRutgers",
            "description": "Supports undocumented students at Rutgers, promotes awareness, and advocates for their rights."
        },
        {
            "name": "UNICEF (Rutgers)",
            "description": "Works to improve the lives of children worldwide through advocacy and fundraising."
        },
        {
            "name": "Unified Sports Club (Rutgers Recreation)",
            "description": "Promotes social inclusion by uniting Rutgers students and individuals with special needs on sports teams."
        },
        {
            "name": "Union of Cuban American Students at Rutgers",
            "description": "Introduces Cuban values to the Rutgers community and celebrates Cuban culture through activities."
        },
        {
            "name": "United Black Council",
            "description": "Umbrella organization for African, African-American, and Afro-Caribbean student organizations at Rutgers."
        },
        {
            "name": "United Muslim Relief",
            "description": "Club that supports UMR's mission of implementing relief and development programs to improve lives."
        },
        {
            "name": "University Choir",
            "description": "Studies and performs a variety of choral works at Rutgers University."
        },
        {
            "name": "Unión Estudiantil Puertorriqueña (Rutgers)",
            "description": "Promotes Puerto Rican culture and engages in intellectual and social activities for its members."
        },
        {
            "name": "Unplugged - The Board Gaming Club",
            "description": "Brings together board game enthusiasts at Rutgers for fun and socializing."
        },
        {
            "name": "VALORANT (Rutgers)",
            "description": "Community for Rutgers students to play and compete in VALORANT, catering to casual and competitive players."
        },
        {
            "name": "Valuating (Rutgers University)",
            "description": "Educates members about stock valuation methods and equity analysis through research and application."
        },
        {
            "name": "Veg Society (Rutgers)",
            "description": "Provides support, resources, and activism opportunities for vegan, vegetarian, and veg-curious students at Rutgers."
        },
        {
            "name": "Venture Capital Club of Rutgers University (Provisional Organization)",
            "description": "Professional organization offering career and educational opportunities in the venture capital industry."
        },
        {
            "name": "Verbal Mayhem Poetry Collective",
            "description": "Promotes poetic performance, artistic growth, and competition opportunities at Rutgers."
        },
        {
            "name": "Verse One",
            "description": "Audition-free dance troupe at Rutgers fostering a comfortable environment for all levels of dancers."
        },
        {
            "name": "Veterinary Science Club (Rutgers University)",
            "description": "Stimulates interest in veterinary medicine through activities and field trips."
        },
        {
            "name": "Video Game Music (Rutgers University Club for)",
            "description": "Explores the intersection of video games and music, providing discussion and exploration opportunities."
        },
        {
            "name": "Vietnamese Student Association",
            "description": "Promotes awareness and appreciation of Vietnamese culture at Rutgers University."
        },
        {
            "name": "Ving Tsun Sport Club (Rutgers Recreation)",
            "description": "Teaches Wing Chun martial arts to students interested in combat efficiency."
        },
        {
            "name": "Voice Acting Network and Collective of Entertainers",
            "description": "Develops talent in voice acting, sound engineering, and video editing through creative projects."
        },
        {
            "name": "Volleyball Men’s Sport Club (Rutgers Recreation)",
            "description": "Email: RUClubVolleyball@gmail.com"
        },
        {
            "name": "Volleyball Women’s Sport Club (Rutgers Recreation)",
            "description": "Competitive volleyball club with A and B teams, and a practice team."
        },
        {
            "name": "Voorhees Choir",
            "description": "Cultivates interest in women’s choral repertoire through performances."
        },
        {
            "name": "Wanawake (Rutgers University)",
            "description": "Unites college women for African interests and culture promotion."
        },
        {
            "name": "Water Polo Sport Club (Rutgers Recreation)",
            "description": "Co-ed team competing in water polo tournaments during fall and spring semesters."
        },
        {
            "name": "WeatherWatcher Club (Rutgers)",
            "description": "Forecasts and communicates weather and climate using state-of-the-art broadcast equipment."
        },
        {
            "name": "Weightlifting Olympic Sport Club (Rutgers Recreation)",
            "description": "Focuses on Olympic weightlifting techniques and competitions."
        },
        {
            "name": "West Indian Student Organization",
            "description": "Connects Caribbean culture with other cultures in the U.S. through education and celebration."
        },
        {
            "name": "Women Empowerment Through Health and Self-Love",
            "description": "Promotes self-love, healthy choices, and community service among women at Rutgers."
        },
        {
            "name": "Women in Computer Science",
            "description": "Encourages and guides women pursuing careers in computer science and related fields."
        },
        {
            "name": "Women in Information Technology & Informatics",
            "description": "Empowers women in IT and provides skills, mentorship, and networking opportunities."
        },
        {
            "name": "Women in the Health Professions",
            "description": "Unites women in health professions at Rutgers, fostering lifelong connections and career development."
        },
        {
            "name": "Women's Gaming League (Rutgers)",
            "description": "Creates a safe space for women gamers at Rutgers to forge friendships and enjoy gaming."
        },
        {
            "name": "Women's Leadership Coalition (Graduate Organization)",
            "description": "Brings graduate students together to promote personal, professional, and academic development."
        },
        {
            "name": "Women's, Gender, and Sexuality Studies (Graduate Student Organization)",
            "description": "Facilitates student-led initiatives at the Women's, Gender, and Sexuality Studies department."
        },
        {
            "name": "Womens Political Caucus (Rutgers)",
            "description": "Multi-partisan organization empowering women in politics and engaging students on women's issues."
        },
        {
            "name": "Women’s Pre-Law Society (Rutgers)",
            "description": "Empowers women and non-binary pre-law students with resources and networking opportunities."
        },
        {
            "name": "Women’s Rowing (Division I Rutgers Athletics)",
            "description": "Competes in Division I NCAA varsity rowing, representing Rutgers in the Big Ten Conference."
        },
        {
            "name": "Wrestling Sport Club (Rutgers Recreation)",
            "description": "Provides updates via GroupMe for wrestling club activities at Rutgers."
        },
        {
            "name": "WRSU-FM New Brunswick",
            "description": "Non-commercial college radio station broadcasting from Rutgers University in New Brunswick."
        },
        {
            "name": "Wushu Sport Club (Rutgers Recreation)",
            "description": "Teaches Wushu (Chinese martial arts) for health, fitness, performance, and competition."
        },
        {
            "name": "Young Life",
            "description": "Community promoting fun, relationships, and personal growth among students at Rutgers."
        },
        {
            "name": "Young Life (Chaplaincy)",
            "description": "Builds community and explores faith, welcoming students regardless of beliefs."
        },
        {
            "name": "Youth Empowerment Club",
            "description": "Engages children in the New Brunswick area through educational and social programs."
        },
        {
            "name": "YuGiOh Club (Rutgers)",
            "description": "Teaches and competes in the Yu-Gi-Oh! trading card game, fostering a gaming community."
        },
        {
            "name": "Zeta Beta Tau",
            "description": "ZBT fraternity chapter at Rutgers, promoting excellence and brotherhood."
        },
        {
            "name": "Zeta Phi Beta",
            "description": "Promotes sisterhood and cultural awareness, founded at Howard University in 1920."
        },
        {
            "name": "Zeta Psi Fraternity",
            "description": "International men’s fraternal organization dedicated to academic excellence and brotherhood."
        },
        {
            "name": "Zeta Tau Alpha",
            "description": "Creates a sisterhood environment emphasizing friendship and fraternity values."
        }

    ]
}
